function andalques() 
{
    functionname ="andal";
    
var mudhalques = 
[
"ஆண்டாள் அவதரித்த திவ்யதேசம் எது ? அதற்கு வேறு பெயர் என்ன ?",
"ஆண்டாள் அவதரித்த மாதம், நட்சத்திரம் எது ?",
"ஆண்டாள் அருளிய நூல்கள் யாவை ?",
"திருப்பாவையில் உள்ள பாசுரங்கள் எத்தனை ?",
"நாச்சியார் திருமொழியில் உள்ள பாசுரங்கள் எத்தனை ?",
"திருப்பாவையில் தொடக்கச் சொல் எது ?",
"நாச்சியார் திருமொழியில் எத்தனை பதிகங்கள் உள்ளன ?",
"நாச்சியார் திருமொழியில் முதற்பாசுரத்திலுள்ள முதல் சொல் எது ?",
"'சூடிக்கொடுத்த நாச்சியார்' பெயர்க்காரணம் கூறுக ?",
"ஆண்டாள் எந்த அர்ச்சாவதாரப் பெருமாளை மாலையிட்டு மணந்தாள் ?",
"திருப்பாவைஜீயர் என்றழைக்கப்படுபவர் யார் ? காரணம் என்ன ?",
"பாவை நோன்பு, பாகவதத்தில் பெறும் பெயர் என்ன ?",
"கண்ணனுக்கு உகந்த மாதம் எது ?",
"நந்தகோபன் வைத்திருந்த ஆயுதம் எது ?",
"பகல்பத்து இராப்பத்து, இயற்பா உற்சவம் ஆகியவற்றை முறைப்படுத்தி நடத்த எந்த ஆசார்யர் ஏற்பாடு செய்தார் ?",
"எவற்றைப் பாவை நோன்பாளர்கள் விலக்குகிறார்கள் ?",
"எவற்றைப் பாவை நோன்பின் போது கைக் கொள்வார்கள் ?",
"திருப்பாவை முதற்பாடலில் முக்கியமான செய்தி என்ன ?",
"திருப்பாவையின் மூன்றாம் பாடலில் கூறப்படும் அவதாரம் எது ?",
"புள் அரையன் யார் ?",
"கடலை ஆழி என்றது ஏன் ?",
"தூய பெருநீர் கொண்ட நதி எது ?",
"மனத்துக்கினியான் யார் ?",
"நந்தகோபாலன் அறம் செய்வது எவற்றை ?",
"நந்தகோபாலன் மருமகள் யார் ?",
"பரமன் துயில்கின்ற இடங்களாக திருப்பாவை குறிப்பது எவற்றை ?",
"திருப்பாவையில் குறிப்பிடப்படும் விளக்குகள் யாவை ?",
"பஞ்சசயனம் - விளக்குக ?",
"முப்பத்து மூன்று வகையான தேவர்கள் யார் ?",
"கண்ணனின் அருள் நோக்கு எவற்றைப் போக்கடிக்கும் ?",
"திருப்பாவையில் குறிக்கப்படுவன :",
"ஆண்டாள் கண்ணனின் மேனியையும், கண்ணையும், முகத்தையும் எவ்வாறு வருணிக்கிறார் ?",
"ஆண்டாள் வள்ளல் என்று குறிப்பிட்ட பாண்டிய நாட்டு திவ்வியதேசப்பெருமாள் யார் ?",
"யார் யார் வந்திருந்து தன்னை மகட்பேசி மந்திரித்ததாக ஆண்டாள் கூறுகிறாள்?",
"கோவிந்தா - பொருள் தருக",
"கூடார் என்றால் யார் ?",
"கறவைகள் பின் செல்பவர் யாவர் ?",
"வங்கக்கடல் என ஆண்டாள் குறிப்பிடுவது எக்கடலை ?",
"கண்ணன் உரலில் கட்டுண்டதைக் குறிக்கும் திருப்பாவைத் தொடர் ?",
"வத்ஸாசுரன் -- கபித்தாசுரன் பற்றித் திருப்பாவையில் இடம் பெறும் தொடர் எது ? எங்கு கூறப்படுகிறது ?",
"அமுதம் கடைந்த வரலாறு காட்டும் தொடர்..",
"திருப்பாவையின் முக்கியத்துவம் யாது ?",
"திருப்பாவையில் எந்த ஒரே பாடல் மட்டுமே முழுப்பலனையும் தரும் ?",
"திருப்பாவை அனுசந்திப்பதின் பயன் என்ன ?",
"திருப்பாவைக்கு மூவாயிரப்படி உரையருளியவர் யார் ?",
"திருப்பாவைக்கு ஆறாயிரப்படி உரை அருளியவர் யார் ?",
"ஆண்டாள் வாழ்வில் காட்டப்பட்ட அற்புதமான சமுதாயச் செய்தி என்ன ?",
"கோதை விஷயமான வடமொழி ச்லோகங்கள் யாவை ?",
"யாருடைய அம்சம் பலராமன் ?",
"'மார்கழித் திங்கள்' என்று தொடங்கும் பாசுரம் எந்த பிரபந்தத்தில் உள்ளது ?",
"'வங்கக்கடல்' என்று ஆண்டாள் குறிப்பிடுவது எதை ? எப்படி ?",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1"];

var mudhalans = 
[
"ஸ்ரீவில்லிபுத்தூர் - புதுவை ",
"ஆடி மாதம், பூரம் நட்சத்திரம்.",
"திருப்பாவை, நாச்சியார் திருமொழி. ",
"30. ",
"143. ",
"மார்கழி. ",
"14 பதிகங்கள். ",
"தை .",
"வடபெரும் கோயில் உடையான், கோதை சூடிக்கொடுத்த மாலையை விரும்பி ஏற்றதால் கோதைக்கு இப்பெயர் ஏற்பட்டது.",
"ஸ்ரீரங்கநாதன். ",
"ஸ்ரீராமானுஜர். இவர் திருப்பாவையின் கருத்தில் மனத்தைப் பறிகொடுத்தவர். இவர் திருப்பாவையை 'கோதோபநிஷத்' என்று போற்றி மாதுகர ஸமயத்தில் அநுஸந்தித்தார். ",
"காத்தியாயினி விரதம். ",
"மார்கழி. ",
"கூர்வேல். ",
"நாதமுனிகள். ",
"நெய் அருந்துவது, பால் உண்பது, மையிடுவது, மலர் (சூட்டுவது, புறங்கூறுவது, மேலையார் செய்யாதன செய்வது. ",
"நாட்காலே நீராடி, பரமனடிபாடி, ஐயமும் பிச்சையும் அளித்து, உய்யும் வழிபெற்றோமே என எண்ணியபடி வாழ்வார்கள். ",
"நாராயணனே நமக்கே பறை தருவான் என்பது. ",
"திரிவிக்ரம அவதாரம். (ஓங்கி உலகளந்த அவதாரம்) ",
"பல ஸ்ரீகருடன். ",
"ஆழங்காண முடியாததால் ஆழி எனப்பட்டது.",
"யமுனை. ",
"ஸ்ரீராமன்.",
"ஆடை, தண்ணீர், சோறு என வாரி வழங்குவான். ",
"நப்பின்னை. ",
"1. ஆலிலை 2. பாற்கடல். ",
"கோலவிளக்கு, அணிவிளக்கு, குத்துவிளக்கு மற்றும் குலவிளக்கு. ",
"மென்மை, பரிமளம், வெண்மை , அழகு, குளிர்ச்சி பொருந்திய சயன ஆசனம். ",
"உருத்திரர்கள் 11 ஆதித்தியர்கள் 12 வசுக்கள் 8 அசுவினி தேவதைகள் 2. ",
"சாபத்தையும் நீக்கும், பாபத்தையும் நீக்கும். ",
"ஒரு கொடி - மாதவி ஒரு குன்று - கோவர்த்தனம் ஒரு நகர் - வட மதுரை ஒரு தீவு - இலங்கை ஒருத்தி - யசோதை (அ) தேவகி ஒரு விளையாட்டுப் பொருள் - கைப்பந்து ",
"'கார்மேனிச் செங்கண் கதிர்மதியம் போல் முகத்தான்'.",
"மாலிருஞ்சோலை மணாளனார். ",
"'இந்திரனுள்ளிட்ட தேவர் குழாமெல்லாம்.' ",
"பசுக்களைக் காப்பவனே அனைத்து உயிர்களையும் காப்பவனே.",
"கண்ணனுடனும் அவன் அடியார்களுடனும் கூடாதவர்களைக் குறிக்கும். ",
"ஆயர்.",
"திருப்பாற்கடல். ",
"தாயைக்குடல் விளக்கம் செய்த தாமோதரன். ",
"கன்று குணிலா எறிந்தாய் என்பதால் கூறப்படுகிறது. ",
"வங்கக்கடல் கடைந்த மாதவனை.",
"தினமும் எல்லா ஸந்நிதிகளில் தவறாது ஓதப்பட்டு வருகிறது. ஒவ்வொரு வைஷ்ணவனும் இதை நாள்தோறும் பாராயணம் செய்ய வேண்டும்.",
"சிற்றஞ்சிறுகாலே (29).",
"எங்கும் திருவருள் பெற்று இன்புறுவதே. ",
"பெரியவாச்சான் பிள்ளை. ",
"அழகிய மணவாளப் பெருமாள் நாயனார். ",
"பெண்ணைப் பெற்றாலும் தந்தைக்குப் பெருமை கிடைக்கும் என்பதே (பெரியாழ்வார் அரங்கனுக்கே மாமனரானார்). ",
"வேதாந்த தேசிகர் வழங்கிய கோதாஸ்துதி, அநந்தாழ்வான் சாதித்த கோதா சதுச்லோகீ மற்றும் கோதாமங்களம் ஆகியவை.",
"ஆதிசேஷனின் அம்சம். ",
"திருப்பாவையில் உள்ளது. ",
"திருப்பாற்கடல் - வங்கம் = அலை, வங்கம் = கப்பல் அலைகள் மிக்க கடல், எம்பெருமானாகிய கப்பல் உள்ள கடல்",
"ans7",
"ans7",
"ans8",
"ans8",
"ans9",
"ans7",
"ans7",
"ans8",
"ans8",
"ans9",
"ans7",
"ans8",
"ans9"];

var numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21
, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43,
44, 45, 46, 47, 48, 49, 50];

function shuffle(o) {
    for(var j, x, i = o.length; i; j = parseInt(Math.random() * i), x = o[--i], o[i] = o[j], o[j] = x);
    return o;
};

var random = shuffle(numbers);
console.log(random);
document.getElementById("question1").innerHTML = "1. " + mudhalques[random[0]];
document.getElementById("question2").innerHTML = "2. " + mudhalques[random[1]];
document.getElementById("question3").innerHTML = "3. " + mudhalques[random[2]];
document.getElementById("question4").innerHTML = "4. " + mudhalques[random[3]];
document.getElementById("question5").innerHTML = "5. " + mudhalques[random[4]];
document.getElementById("question6").innerHTML = "6. " + mudhalques[random[5]];
document.getElementById("question7").innerHTML = "7. " + mudhalques[random[6]];
document.getElementById("question8").innerHTML = "8. " + mudhalques[random[7]];
document.getElementById("question9").innerHTML = "9. " + mudhalques[random[8]];
document.getElementById("question10").innerHTML = "10. " + mudhalques[random[9]];

document.getElementById("answer1").innerHTML = "Ans. " + mudhalans[random[0]];
document.getElementById("answer2").innerHTML = "Ans. " + mudhalans[random[1]];
document.getElementById("answer3").innerHTML = "Ans. " + mudhalans[random[2]];
document.getElementById("answer4").innerHTML = "Ans. " + mudhalans[random[3]];
document.getElementById("answer5").innerHTML = "Ans. " + mudhalans[random[4]];
document.getElementById("answer6").innerHTML = "Ans. " + mudhalans[random[5]];
document.getElementById("answer7").innerHTML = "Ans. " + mudhalans[random[6]];
document.getElementById("answer8").innerHTML = "Ans. " + mudhalans[random[7]];
document.getElementById("answer9").innerHTML = "Ans. " + mudhalans[random[8]];
document.getElementById("answer10").innerHTML = "Ans. " + mudhalans[random[9]];

document.getElementById("showhidebut").style.display = "block"
document.getElementById("refreshQuest").style.display = "block"
document.getElementById("refreshpage").style.display = "block"
}