function manavalamamuniques() 
{
    functionname ="manavalamamuni";
    
var mudhalques = 
[
"திருவாய்மொழிப் பிள்ளையின் பிரதான சீடர் யார் ?",
"மணவாள மாமுனிகளின் அவதார ஸ்தலமாக வழங்கப்படும் திவ்ய தேசம் எது ?",
"மணவாள மாமுனிகள் யாருடைய அவதாரமாக வணங்கப்படுகிறார் ?",
"மணவாள மாமுனிகள் அவதார ஆண்டு, திங்கள், நக்ஷத்திரம் யாவை?",
"மணவாள மாமுனிகளின் மற்ற திருநாமங்கள் யாவை ?",
"மணவாள மாமுனிகள் பூர்வாச்ரம திருநாமம், திருவம்சத்தைப் பற்றிக் கூறுக.",
"மணவாள மாமுனிகள் அருளிச் செய்த கிரந்தங்கள் யாவை ?",
"மணவாள மாமுனிகளின் யதிராஜவிம்சதி பற்றி குறிப்பு வரைக.",
"மணவாள மாமுனிகளின் உபதேச ரத்தினமாலை பற்றிய குறிப்பு வரைக.",
"மணவாள மாமுனிகளின் திருவாய்மொழி நூற்றந்தாதி பற்றிய குறிப்பு வரைக.",
"மணவாள மாமுனிகளின் ஆர்த்தி பிரபந்தம் பற்றிய குறிப்பு வரைக. ",
"மணவாள மாமுனிகளின் தேவராஜ மங்களம் பற்றிய குறிப்பு வரைக.",
"மணவாள மாமுனிகள் அருளிச்செய்த வியாக்கியான கிரந்தங்கள் (உரை நூல்கள்) யாவை? ",
"மணவாள மாமுனிகள் விஷயமாக அருளிச் செய்யப்பட்டுள்ள கிரந்தங்கள் - யாவை ? ",
"மணவாள மாமுனிகளின் அஷ்டதிக்கஜங்களான சீடர்கள் யாவர் ?",
"மணவாள மாமுனிகளின் விஷயமான தனியன் எது ?",
"'ஸ்ரீசைலேச' தனியன் எப்பொழுது எங்கே யார் அருளிச் செய்தார் ?",
"'ஸ்ரீசைலேச' தனியனின் முக்கியத்துவம் என்ன ?",
"அருளிச்செயல் ஓதும்பொழுது, தொடக்கத்திலும் முடிவிலும் ஏன் 'ஸ்ரீசைலேச' தனியன் அநுஸந்திக்கப்படுகிறது ? ",
"மாமுனிகள் காலத்தில் வாழ்ந்திருந்த மற்ற ஆசாரியர்கள் யார் யார் ?",
"மாமுனிகளின் திருவத்யயன தினமாக எந்த நாள் யாரால் எங்கு இப்பொழுதும் கொண்டாடப்படுகிறது ? ",
"மாமுனிகளின் திருவரசு எவ்விடத்திலுள்ளது ?",
"சிக்கில் கிடாரம் என்கிற ஊர் மாமுனிகளோடு எப்படி ஸம்பந்தப்பட்டுள்ளது ?",
"மாமுனிகளின் கிரந்தங்களுக்கு வியாக்கியானம் அருளிச் செய்தவர் யார் ?",
"மாமுனிகள் ஸ்ரீபாஷ்ய காலக்ஷேபம் எவ்விடத்தில் ஸாதித்தருளினார் ?",
"மாமுனிகளின் திருவடி நிலைகளுக்கான திருநாமம் என்ன ?",
"மாமுனிகளின் அஸாதாரண பெருமை என்ன?",
"மாமுனிகளுக்குப் பெரியபெருமாள் அளித்த மற்ற ஸன்மானங்கள் எவை ?",
"ஸ்ரீரங்கத்தில் உள்ள மாமுனிகளின் ஸன்னிதியின் விசேஷம் என்ன ?",
"திருவேங்கடத்தில் மாமுனிகள் ஏற்படுத்திய கைங்கர்யம் எவை ?",
"உபதேச ரத்னமாலை எத்தனை வெண்பாக்களால் ஆனது ?",
"உபதேச ரத்தின மாலைக்கு உரை எழுதியவர் யார் ?",
"கோயில் கந்தாடை அண்ணன் என்பவர் யார் ?",
"கோயில் கந்தாடை அண்ணனின் திருக்குமாரர் பெயர் என்ன ?",
"ஸ்ரீமணவாளமாமுனிகள் எந்த திவ்யதேசத்தில் திருவாய்மொழி காலக்ஷேபம் ஸாதித்தார் ?",
"ஈடு முப்பத்தாறாயிரப் பெருக்கர் யார் ?",
"திருவாய்மொழி நூற்றந்தாதியினை அருளிச்செய்தவர் யார் ?",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1"];

var mudhalans = 
[
"மணவாள மாமுனிகள் ",
"ஆழ்வார் திருநகரி. ",
"ராமாநுஜராக அவதரித்த ஆதிசேஷனின் அவதாரமாக வணங்கப்படுகிறார். ",
"கலியுகம் 4472 (கி.பி. 1370) ஸாதாரண ஆண்டு , ஐப்பசித் திங்கள் மூல நக்ஷத்திரம் ஆகும். ",
"பெரிய ஜீயர், ஸெளம்யஜாமாத்ரு முனி, வரவரமுனி, விசதவாக் சிகாமணி, - ரம்யஜாமாத்ரு முனி, யதீந்த்ர ப்ரவணர், ஈடு முப்பத்தாறாயிரப் பெருக்கர். ",
"திருநாமம் - அழகிய மணவாளப் பெருமாள் நாயனார்; தகப்பனார் - திகழக் கிடந்தான் திருநாவீறுடைய தா(ச)தரண்ணர்; தாயார் - ஸ்ரீரங்க நாச்சியார் (பிள்ளை உலகாரியரின் சீடரான கொல்லிகாவல தாஸரின் திருக்குமாரத்தி); மகன் - இராமாநுசம் பிள்ளை போரன் - ஜீயர் நாயினார் (அபிராமவரர்) ",
"யதிராஜ விம்சதி, உபதேச ரத்தினமாலை, திருவாய்மொழி நூற்றந்தாதி, ஆர்த்தி பிரபந்தம், தேவராஜ மங்களம், ஜீயர்படி திருவாராதன க்ரமம் (உரைநடையில்) மற்றும் பல தனிப் பாடல்கள்.",
"யதிராஜ விம்சதி ஆழ்வார் திருநகரியில் சேவை ஸாதிக்கும் ராமாநுஜர் விஷயமாக பூர்வாச்ரமத்தில் ஆசார்யன் ஆணைக்கிணங்க அருளிச்செய்த 10 ச்லோகங்கள் கொண்ட வடமொழி ஸ்தோத்திர நூலாகும். ",
"உபதேச ரத்தினமாலை தமிழில் வெண்பா பாடல்களாலான அருளிச்செயலாகும். இதில் ஆழ்வார்கள், ஆண்டாள், மதுரகவிகள், எம்பெருமானார் ஆகியோர் அவதரித்த மாதங்கள், நாள்கள் கூறப்பட்டுள்ளன. எம்பெருமானாரின் இன்னருள், திருவாய்மொழிக்கான வியாக்யானங்கள், ஈடு பெற்ற முறை, பிள்ளை உலகாரியரின் ஸ்ரீவசன பூஷண நூலின் சிறப்பு, ஆசார்யனின் பெருமை, சிஷ்ய லஷணம் முதலியவை கூறப்பட்டுள்ளன. ஸ்ரீவைஷ்ணவர்கள் தினமும் பாராயணம் செய்ய வேண்டியதொன்றாகும். ",
"தமிழில் 100 வெண்பா பாடல்களைக் கொண்ட அருளிச் செயலாகும். திருவாய்மொழி போல் அந்தாதி வடிவில் அமைந்ததாகும். முதல் பாடல் திருவாய்மொழியின் முதல் பதிகத்தின் முதல் பாசுரத்தின் முதல் வார்த்தையிலுள்ள ஓர் எழுத்து, சீர், அசை கொண்டு தொடங்கி (உதாரணம் - உயர்), இம்முதல் பாடலின் ஈற்றடியின் இறுதியில் திருவாய்மொழியின் இரண்டாம் பதிகத்தின் முதல் பாசுரத்தின் முதல் வார்த்தையிலுள்ள ஓர் எழுத்து, சீர், அசை அமையப்பெற்றதாகும். (உதாரணம் - வீடு). இங்ஙனம் திருவாய்மொழியின் நூறு பதிகங்களுக்குமாக அருளிச் செய்யப்பட்ட ஒவ்வொரு பாடலிலும் அந்த பதிகத்தின் பொருளும் கூறப்பட்டு திருவாய் மொழியை இயற்றிய நம்மாழ்வாரின் திருப்பெயர்களிலொன்றும் இடம் பெற்றிருக்கும். இதனை தினந்தோறும் பாராயணம் செய்வது ஸ்ரீவைஷ்ணவர்களின் கடமையாகும்.",
"மணவாள மாமுனிகள் எப்பெருமானாரின் பெருமைகளைக் கூறித் தம்மை விரைவில் பரமபதத்தில் அவருடைய திருவடிக் கீழ்த் தொண்டாற்ற அருள் செய்யும்படிப் பிரார்த்திக்கின்ற அருளிச்செயலாகும். ",
"மாமுனிகள் திருக்கச்சிக்கு எழுந்தருளினபோது காஞ்சி வரதராஜரின் (அத்திகிரி அருளாளரின்) மங்களாசாஸனமாக அருளிச்செய்த வடமொழி நூலாகும். ",
"பிள்ளை உலகாரியரின் ஸ்ரீவசந பூஷணம், முமுக்ஷ ப்படி, தத்வத்ரயம் ஆகியவற்றிற்கும், அழகிய மணவாளப் பெருமாள் நாயனார் அருளிச்செய்த ஆசார்ய ஹிருதயத்திற்கும், அமுதனாரின் இராமாநுச நூற்றந்தாதிக்கும், பெரியாழ்வார் திருமொழியில் முதல் 400 பாசுரங்களுக்கும், அருளாளப் பெருமாள் எம்பெருமானாரின் ஞானஸாரம், பிரமேயஸாரம் ஆகியவற்றிற்கும் ஆகும். ",
"வடமொழியில் - கந்தாடை அண்ணனின் வரவரமுனி அஷ்டகம், பிரதிவாதி பயங்கரம் அண்ணாவின் வரவரமுனி சதகம், வரவரமுனி சுப்ரபாதம், எறும்பியப்பாவின் பூர்வ தினசர்யை, உத்தரதினசர்யை, மற்றும் வரவரமுனி முக்தகம் ஆகும். தமிழில் - கோயிலண்ணனின் மணவாள மாமுனிகள், கண்ணிநுண் சிறுத்தாம்பு, அண்ணாவின் பாதாதிகேசமாலை, அப்பிள்ளாரின் ஸம்பிரதாய சந்திரிகை ஆகும்.",
"பொன்னடிக்கால் ஜீயர் (வானமாமலை ஜீயர்), பரவஸ்து பட்டர்பிரான் ஜீயர், திருவேங்கட ராமாநுஜ ஜீயர் கோயிலண்ணன், பிரதிவாதி பயங்கரம் அண்ணா , எறும்பியப்பா, அப்பிள்ளை, அப்பிள்ளார் ஆகிய அஷ்டதிக்கஜங்களாவர்.",
"'ஸ்ரீசைலேச தயாபாத்ரம் தீபக்த்யாதி குணார்ணவம் யதீந்த்ர ப்ரவணம் வந்தே ரம்யஜாமாத்ருமுனிம்' என்பதாகும்.",
"மணவாள மாமுனிகள் ஓராண்டு காலம் ஸ்ரீரங்கத்தில் பெரிய பெருமாள் ஸன்னதியில் பெரிய திருமண்டபத்தில் திருவொய்மொழிக்கான வியாக்கியானங்களைக் கொண்டு காலக்ஷேபம் சாதித்தருள, சாற்றுமுறை தினமான ஆனந்த ஆண்டு ஆனி திருமூலத்தன்று ஒரு அர்ச்சகரின் சிறுவன் வடிவிலே வந்து பெரிய பெருமாள் தாமே அருளிச் செய்தார். இதே ஸமயம் திருவதரி, திருநாராயணபுரம், திருவேங்கடம், அழகர் திருமலை முதலான திவ்ய தேசங்களிலும் இந்த தனியன் ஸ்ரீவைஷ்ணவர்களுக்கு ஸ்வப்ன மூலமாக அருளிச் செய்யப்பட்டது. கோயிலண்ணன் திருமாளிகைப் பெண்டிர்க்கு சிற்றோலை மூலமாகவும் வழங்கப்பட்டது. ",
"'ஸ்ரீசைலேச தயாபாத்ரம்” என்பது 'ஓம்' என்கிற பிரணவத்திற்கொப்பாகும். 'ஒம்' என்பதில் உள்ள அகாரம் எம்பெருமான் ஸ்ரீமந்நாராயணனைக் குறிக்கிறது. மகாரம், எம்பெருமானின் இன்னருளுக்கு உரிய அடியவனான ஜீவனைக் (நம்மை) குறிக்கிறது. உகாரம் ஜீவன் (நாம்) எம்பெருமானுக்கே உரியவன் என்கிற ஒழிக்கவொண்ணா உறவு முறையைக் குறிக்கிறது. அதேபோல் 'ஸ்ரீசைலேச என்பது திருமலையப்பனான ஸ்ரீமந்நாராயணனைக் குறிப்பிடுகிறது. 'தயாபாத்ரம்' என்பது அவனது இன்னருளுக்குரிய அடியவனான ஜீவனைக் (நம்மை ) குறிப்பிடுகிறது. மீண்டும், 'தயாபாத்ரம்' என்பது ஜீவன் (நாம்) எம்பெருமானுக்கே உரியவன் என்கிற ஒழிக்கவொண்ணா உறவுமுறையையும் குறிக்கிறது. ",
"வேதவேதாந்தங்களை ஒதும்பொழுது தொடக்கத்திலும் முடிவிலும் 'ஓம்' அநுஸந்திக்கப்படுவதுபோல் அதற்கு இணையாக 'ஸ்ரீசைலேச தயாபத்ரம்' ஆழ்வார்களின் அருளிச் செயல் மற்றும் ஆசார்யர்களின் ஸ்தோத்ர நூல்களின் தொடக்கத்திலும் முடிவிலும் அநுஸந்திக்கப்படுகிறது. ",
"ஆய் ஜனன்யாசார்யர், சடகோப ஜீயர், கிடாம்பி நாயினார். ",
"73 திருநக்ஷத்திரங்கள் வாழ்ந்திருந்து ருத்ரோத்காரி ஆண்டு (கி.பி. 1444) மாசி மாத கிருஷ்ணபக்ஷ துவாதசியன்று ஆசாரியன் திருவடி அடைந்தார். இந்த நாள் மாமுனிகள் திருவத்யயன உற்சவ தினமாக ஸ்ரீரங்கத்தில் நம்பெருமாளால் கொண்டாடப் பெறுகிறது.",
"ஸ்ரீரங்கத்தில் வட திருக்காவேரிக் கரையிலுள்ள ஆளவந்தார் படித்துறைக்கு அருகில் அமைந்துள்ளது. ",
"மாமுனிகளின் தாய்வழி பாட்டனாரான கொல்லிகாவல தாஸர் வாழ்ந்த ஊர். இங்கு மாமுனிகள் தனது பிள்ளைப் பருவத்திலே வாஸம் செய்திருந்தார். ",
"பிள்ளைலோகம் ஜீயர் என்கிற ஆசார்யர் ஆவார். ",
"ஸ்ரீபெரும்பூதூரில் உடையவர் ஸன்னிதி பின்புறத்திலும், காஞ்சீபுரத்தில் சொன்னவண்ணம் செய்த பெருமாள் ஸன்னிதியில் பொய்கையாழ்வார் அவதார ஸ்தல மண்டபத்திலும் அருளிச்செய்தார். ",
"பொன்னடியான் செங்கமலம். ",
"ஆசார்ய பரம்பரையில் முதல் ஆசார்யரான பெரியபெருமாள் தாமே மாமுனிகளைத் தமக்கு ஆசாரியராக ஏற்றுக்கொண்டதாகும். ",
"பெரியபெருமாள் தமது சேஷ பர்யங்கமாகிற ஸிம்மாஸனத்தையும், பல்லவராயன் மடத்தையும் அளித்து கௌரவித்தார். ஸ்ரீரங்கத்தில் இந்த மடத்தில் மாமுனிகள் ஸன்னிதி உள்ளது. ",
"மாமுனிகள் தமது மடத்தில் காலக்ஷேப் மண்டபத்தை பிள்ளை உலகாரியரின் திருமாளிகையிலிருந்து 'ரகஸியம் விளைந்த மண்' என்று மண்ணை எடுத்து வந்து சமைத்து அம்மண்டபத்திற்குத் தமது ஆசார்யரான திருவாய்மொழிப் பிள்ளையின் திருநாமத்தைச் சாற்றியருளி சிஷ்ய பரிபாலனம் செய்து வந்தார். தமக்குத் தொண்டாற்றிக் கொண்டிருந்த அம்மையாருக்குத் தமது வெளுத்த திருமேனியைக் கொண்டு தாம் ஆதிசேஷன் அவதாரம் என்று காட்டியருளினார். ",
"எம்பெருமானாரால் நிறுவப்பெற்ற ஜீயருக்கு உறுதுணையாக சிறிய கேள்வி அப்பன் ஜீயர் ஒருவரை நியமித்தார். பிரதிவாதி பயங்கரம் அண்ணாவைக் கொண்டு திருவேங்கடமுடையான் விஷயமாக ஸுப்ரபாதம், ஸ்தோத்திரம், பிரபத்தி, மங்களம் ஆகியவை அருளிச்செய்து தநுர்மாதம் (மார்கழி) நீங்கலாக மற்ற நாட்களில் அதிகாலையில் அநுஸந்திக்கச் செய்தார். ",
"73 வெண்பாக்கள்.",
"பிள்ளைலோகஞ்சீயர். ",
"மணவாளமாமுனிகள் சீடர்.",
"கோயில் கந்தாடை நாயன்.",
"பல் திருவரங்கத்தில்.",
"மணவாள மாமுனிகள்.",
"மணவாள மாமுனிகள்.",
"ans7",
"ans8",
"ans8",
"ans9",
"ans7",
"ans8",
"ans9"];

var numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21
, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36];

function shuffle(o) {
    for(var j, x, i = o.length; i; j = parseInt(Math.random() * i), x = o[--i], o[i] = o[j], o[j] = x);
    return o;
};

var random = shuffle(numbers);
console.log(random);
document.getElementById("question1").innerHTML = "1. " + mudhalques[random[0]];
document.getElementById("question2").innerHTML = "2. " + mudhalques[random[1]];
document.getElementById("question3").innerHTML = "3. " + mudhalques[random[2]];
document.getElementById("question4").innerHTML = "4. " + mudhalques[random[3]];
document.getElementById("question5").innerHTML = "5. " + mudhalques[random[4]];
document.getElementById("question6").innerHTML = "6. " + mudhalques[random[5]];
document.getElementById("question7").innerHTML = "7. " + mudhalques[random[6]];
document.getElementById("question8").innerHTML = "8. " + mudhalques[random[7]];
document.getElementById("question9").innerHTML = "9. " + mudhalques[random[8]];
document.getElementById("question10").innerHTML = "10. " + mudhalques[random[9]];

document.getElementById("answer1").innerHTML = "Ans. " + mudhalans[random[0]];
document.getElementById("answer2").innerHTML = "Ans. " + mudhalans[random[1]];
document.getElementById("answer3").innerHTML = "Ans. " + mudhalans[random[2]];
document.getElementById("answer4").innerHTML = "Ans. " + mudhalans[random[3]];
document.getElementById("answer5").innerHTML = "Ans. " + mudhalans[random[4]];
document.getElementById("answer6").innerHTML = "Ans. " + mudhalans[random[5]];
document.getElementById("answer7").innerHTML = "Ans. " + mudhalans[random[6]];
document.getElementById("answer8").innerHTML = "Ans. " + mudhalans[random[7]];
document.getElementById("answer9").innerHTML = "Ans. " + mudhalans[random[8]];
document.getElementById("answer10").innerHTML = "Ans. " + mudhalans[random[9]];

document.getElementById("showhidebut").style.display = "block"
document.getElementById("refreshQuest").style.display = "block"
document.getElementById("refreshpage").style.display = "block"
}