function nammazhwarques() 
{
    functionname ="nammazhwar";
    
var mudhalques = 
["நம்மாழ்வார் எப்பொழுது அவதரித்தார் ?",
"நம்மாழ்வார் அவதரித்த ஊர் எது ?",
"ஆதிசேஷன் எந்த ஊரில் புளியமரமாக ஸேவை ஸாதிக்கிறான் ?",
"திருக்குருகூரின் மறுபெயர் என்ன ?",
"நம்மாழ்வார் அவதரித்த மாதம், நக்ஷத்திரம் எது ?",
"நம்மாழ்வாரின் அர்ச்சைத்திருமேனி எந்த நாளில் பிரதிஷ்டை செய்யப்பட்டது ?",
"நம்மாழ்வாரின் தந்தை பெயர் என்ன ?",
"நம்மாழ்வாரின் தாயார் பெயர் என்ன ?",
"நம்மாழ்வாரின் தாய்தந்தையருக்கு கோயில் அமைந்த இடம் எது ?",
"நம்மாழ்வாரின் தாயார் ஊர் எது ?",
"காரியாரின் தந்தை பெயர் யாது ?",
"கிருஷ்ணத்ருஷ்ணாதத்வம் என்று அழைக்கப்படுபவர் யார் ?",
"அனவரதம் சேனையர் கோன் அடிதொழுபவர் யார் ?",
"நம்மாழ்வாரின் பிற திருப்பெயர்கள் எவை ?",
"நம்மாழ்வார் எந்தெந்த திவ்ய தேசங்களுக்குச் சென்று மங்களா சாசனம் செய்தார் ?",
"நவதிருப்பதிகளை மங்களாசாசனம் செய்த ஆழ்வார் யார் ?",
"ஆழ்வார் என்றாலே பொதுவாக யாரைக் குறிக்கும் ?",
"வகுளாபரணன் என்று அழைக்கப்படும் ஆழ்வார் யார் ?",
"நம்மாழ்வார் ஏன் சடகோபன் என்று அழைக்கப்படுகிறார் ?",
"நம்மாழ்வார் ஏன் மாறன் என்று அழைக்கப்படுகிறார் ?",
"வேதம் தமிழ் செய்த மெய்யன் யார் ?",
"நம்மாழ்வார் எந்த திவ்யதேசத்தின் எம்பெருமானின் அம்சமாகவும் கருதப்படுகிறார் ?",
"நம்மாழ்வார் இயற்றிய பிரபந்தங்கள் எவை ?",
"வேதங்களுக்குச் சமமாக யாருடைய பிரபந்தங்கள் கருதப்படுகின்றன ?",
"திருவிருத்தத்தில் எத்தனை பாசுரங்கள் உள்ளன ?",
"திருவிருத்தத்தில் முதல் பாசுரத்தின் முதல் வார்த்தை என்ன ?",
"திருவாசிரியத்தில் எத்தனை பாடல்கள் உள்ளன ?",
"திருவாசிரியத்தில் முதல் பாசுரத்திலுள்ள முதல் வார்த்தை எது ?",
"பெரியதிருவந்தாதியில் எத்தனை பாசுரங்கள் உள்ளன ?",
"பெரியதிருவந்தாதியில் முதல் பாசுரத்தின் முதல் வார்த்தை என்ன ?",
"திருவாய்மொழியில் எத்தனை பாசுரங்கள் உள்ளன ?",
"திருவாய்மொழியின் 'என்ற முதல் தாய்” யார்' ?",
"திருவாய்மொழியின் 'வளர்த்த இதத் தாய்” யார்' ?",
"நம்மாழ்வாரின் எப்பாசுரம் சங்கப்பலகையில் ஏறி வென்றது ?",
"திருவாய்மொழியில் எத்தனை பதிகங்கள் உள்ளன ? அதில் முதல் பாசுரத்தின் முதல் வார்த்தை என்ன ?",
"திருவாய்மொழிக்கு எத்தனை ஆசார்யர்கள் வியாக்கியானம் செய்துள்ளனர் ? அவர்கள் யாவர் ?",
"திருவாய்மொழி எந்த வேதத்திற்கு சமமாகிறது ?",
"குன்றமெடுத்த பிரான் அடியாரோடு ஒன்றி நின்றவர் யார் ?",
"நம்மாழ்வாரைப் புகழ்ந்து பாடிய தமிழ்ப்புலவர்கள் யாவர் ?",
"நம்மாழ்வார் விஷயமான தமிழ்ப் பிரபந்தங்கள் எவை ?",
"நம்மாழ்வார் விஷயமான வடமொழி ஸ்தோத்திரங்கள் எவை ?",
"ஞானமுத்திரையைத் தம்முடைய ஹிருதயத்தை நோக்கி வைத்துக் கொண்டு சேவை சாதிக்கும் நம்மாழ்வார் எந்த திவ்ய தேசத்தில் எழுந்தருளி உள்ளார் ?",
"நம்மாழ்வார் எந்த நிலையில் எம்பெருமான் திருமுன்பு சேவை சாதிக்கிறார் ?",
"எந்த திவ்ய தேசத்திலுள்ள திருவடிநிலையில் (ஸ்ரீசடாரியில்) நம்மாழ்வார் திருவுருவத்துடன் சேவை சாதிக்கிறார் ?",
"எந்த திவ்ய தேசத்திலுள்ள ஸ்ரீசடாரி ஆதிசேஷன் வடிவில் சேவை சாதிக்கிறார் ?",
"நம்மாழ்வார் எத்தனை ஆண்டுக்காலம் இவ்வுலகில் எழுந்தருளியிருந்தார் ?  ",
"ஸ்வாமி நம்மாழ்வாரின் முதல் சீடர் யார் ?",
"மதுரகவியாழ்வார் அவதரித்த ஸ்தலம் எது ?",
"மதுரகவியாழ்வார் எந்த மாதம் எந்த நாளில் பிறந்தார் ? ",
"மதுரகவியாழ்வாரின் ஆசார்யர் யார் ?",
"ஆசார்யனே ஸர்வமும் என்று ஆசார்யனை வணங்கிய ஆழ்வார் யார் ?",
"மதுரகவியாழ்வார் இயற்றிய பிரபந்தத்தின் பெயர் என்ன ?",
"திருமந்திரத்தின் மத்திய பதம் போலே அருளிச்செயல் நடுவே உள்ள பிரபந்தம் எது ?",
"கண்ணிநுண் சிறுத்தாம்பில் எத்தனை பாசுரங்கள் உள்ளன ?",
"மதுரகவியாழ்வார் நம்மாழ்வாரிடம் கேட்ட கேள்வி என்ன ?",
"மதுரகவியாழ்வார் நம்மாழ்வாரிடம் கேட்ட கேள்விக்கு நம்மாழ்வாரின் பதில் என்ன ?",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1"];

var mudhalans = 
["கலியுகம் தொடங்கி 43 வது நாள்.",
"திருக்குருகூர் எனும் ஆழ்வார் திருநகரி.",
"ஆழ்வார் திருநகரி. ",
"ஆழ்வார் திருநகரி. ",
"வைகாசி மாதம் விசாக நக்ஷத்திரம். ",
"மாசி விசாக நன்னாளில். ",
"காரியார். ",
"உடைய நங்கையார்.",
"அப்பன் கோயில்.",
"திருவண்பரிசாரம். ",
"பொற்காரியார். ",
"நம்மாழ்வார்.",
"நம்மாழ்வார்.",
"சடகோபன், மாறன், காரிமாறன், வழுதிவளநாடன், குருகூர்மன்னன், குருகைக்கோன், பராங்குசன், பெரியன், வகுளாபரணன் என்பனவாகும். ",
"நம்மாழ்வார் எந்த திவ்ய தேசத்துக்கும் செல்லவில்லை.",
"நம்மாழ்வார் மட்டுமே நவதிருப்பதிகளை மங்களாசாசனம் செய்துள்ளார்.",
"நம்மாழ்வாரைக் குறிக்கும். ",
"நம்மாழ்வார்.",
"பிறந்தவுடன் அறியாமையை உண்டாக்கும் சடவாயு தம்மை அண்டவிடாமல் அதனைக் கோபித்ததால் சடகோபர் என்று அழைக்கப்படுகிறார்.",
"பிறந்தவுடன் அழாமல், பால் குடிக்காமல் உலக நடைமுறைக்கு மாறுபட்டு இருந்ததால் மாறன் என்று அழைக்கப்படுகிறார். ",
"நம்மாழ்வார்.",
"திருக்குறுங்குடியில் எழுந்தருளியிருக்கும் நம்பியின் அம்சம்.",
"திருவிருத்தம், திருவாசிரியம், பெரிய திருவந்தாதி, திருவாய்மொழி. ",
"நம்மாழ்வாருடைய நான்கு பிரபந்தங்கள். ",
"நூறு பாசுரங்கள். ",
"பொய். ",
"ஏழு. ",
"செக்கர். ",
"87 பாசுரங்கள். ",
"முயற்றி. ",
"1102 பாசுரங்கள். ",
"நம்மாழ்வார்.",
"இராமானுஜர். ",
"'கண்ணன் கழலிணை' என்னும் பாசுரம்.",
"நூறு பதிகங்கள், உயர்வற.",
"ஐவர்; திருக்குருகைப்பிரான் பிள்ளான், நஞ்சீயர், பெரியவாச்சான் பிள்ளை , நம்பிள்ளை , வாதிகேசரி அழகிய மணவாள ஜீயர்.",
"ஸாமவேதம் (சாந்தோக்ய உபநிஷத்) ",
"சடகோபன்.",
"திருவள்ளுவர், ஒளவையார், இடைக்காடர், கம்பர், இடைச்சங்கப்புலவர்கள்.",
"கண்ணிநுண் சிறுத்தாம்பு, சடகோபரந்தாதி, மாறனலங்காரம். ",
"பராங்குசாஷ்டகம், பராங்குச பஞ்சவிம்சதி, பராங்குச் நக்ஷத்ர மாலிகா. ",
"காஞ்சீபுரத்தில் வரதராஜப் பெருமாள் சன்னிதியில்.",
"திருவடி நிலையாக சேவை சாதிக்கிறார். அதனால் திருவடி நிலைக்கு ஸ்ரீசடாரி என்றும் ஸ்ரீசடகோபன் என்றும் திருநாமமாயிற்று.",
"வானமாமலையிலுள்ள தெய்வநாயகனின் திருவடி நிலையில்.",
"சோளஸிஹ்மபுரத்திலுள்ள தக்கானின் ஸ்ரீசடாரியில் ஆதிசேஷனாக சேவை சாதிக்கின்றார்.",
"35 ஆண்டுகள்.",
"மதுரகவிகள்.",
"திருக்கோளூர்.",
"சித்திரை மாதம் சித்திரை நக்ஷத்திரம்.",
"நம்மாழ்வார்.",
"மதுரகவியாழ்வார்.",
"கண்ணிநுண் சிறுத்தாம்பு.",
"கண்ணிநுண் சிறுத்தாம்பு.",
"பதினொன்று.",
"செத்ததின் வயிற்றில் சிறியது பிறந்தால் எத்தைத் தின்று எங்கே கிடக்கும் ?",
"'அத்தைத் தின்று அங்கே கிடக்கும்'.",
"ans8",
"ans9",
"ans8",
"ans8",
"ans9",
"ans7",
"ans8",
"ans9",
"ans7",
"ans8",
"ans9"];

var numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23
, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45
, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55];

function shuffle(o) {
    for(var j, x, i = o.length; i; j = parseInt(Math.random() * i), x = o[--i], o[i] = o[j], o[j] = x);
    return o;
};

var random = shuffle(numbers);
console.log(random);
document.getElementById("question1").innerHTML = "1. " + mudhalques[random[0]];
document.getElementById("question2").innerHTML = "2. " + mudhalques[random[1]];
document.getElementById("question3").innerHTML = "3. " + mudhalques[random[2]];
document.getElementById("question4").innerHTML = "4. " + mudhalques[random[3]];
document.getElementById("question5").innerHTML = "5. " + mudhalques[random[4]];
document.getElementById("question6").innerHTML = "6. " + mudhalques[random[5]];
document.getElementById("question7").innerHTML = "7. " + mudhalques[random[6]];
document.getElementById("question8").innerHTML = "8. " + mudhalques[random[7]];
document.getElementById("question9").innerHTML = "9. " + mudhalques[random[8]];
document.getElementById("question10").innerHTML = "10. " + mudhalques[random[9]];

document.getElementById("answer1").innerHTML = "Ans. " + mudhalans[random[0]];
document.getElementById("answer2").innerHTML = "Ans. " + mudhalans[random[1]];
document.getElementById("answer3").innerHTML = "Ans. " + mudhalans[random[2]];
document.getElementById("answer4").innerHTML = "Ans. " + mudhalans[random[3]];
document.getElementById("answer5").innerHTML = "Ans. " + mudhalans[random[4]];
document.getElementById("answer6").innerHTML = "Ans. " + mudhalans[random[5]];
document.getElementById("answer7").innerHTML = "Ans. " + mudhalans[random[6]];
document.getElementById("answer8").innerHTML = "Ans. " + mudhalans[random[7]];
document.getElementById("answer9").innerHTML = "Ans. " + mudhalans[random[8]];
document.getElementById("answer10").innerHTML = "Ans. " + mudhalans[random[9]];

document.getElementById("showhidebut").style.display = "block"
document.getElementById("refreshQuest").style.display = "block"
document.getElementById("refreshpage").style.display = "block"
}