function narasimhaques() 
{
    functionname ="narasimha";
    
var mudhalques = 
[
"ஹிரண்யனுக்கு ஏன் கோபம் மூண்டது ?",
"ஹிரண்யன் எதற்காகப் பிரமனை நோக்கிக் கடுந்தவம் புரிந்தான்?",
"ஹிரண்யன் பிரம்ம தேவனிடம் கேட்ட வரம் யாது ?",
"வரம் பெற்ற ஹிரண்யன் முனிவர்களுக்கு இட்ட கட்டளை யாது ?",
"தேவர்கள் திருமாலைச் சரணடைந்த காரணம் என்ன ?",
"தேவர்கள், முனிவர்கள், மக்கள் வாய்களிலிருந்து என்ன வார்த்தை உச்சரிக்கப்படுவதைத் திருமால் கண்டார் ?",
"ஹிரண்யனுக்கு எத்தனை பிள்ளைகள் ?",
"ஹிரண்யனின் நான்காவது மகன் யார்?",
"பிரகலாதன் தாயார் பெயர் என்ன ?",
"ஸ்ரீமந் நாராயணமூர்த்தியின் நாமத்தை பிரஹலாதனுக்கு கருவிலேயே ஓதி வைத்தவர் யார் ?",
"அசுரர்களின் குரு யார் ?",
"சுக்ராசாரியார் குமாரர்கள் யாவர் ?",
"இவர்கள் இருவரும் யாருக்கு கல்வி போதித்து வந்தனர் ?",
"ஆசிரியர் 'ஹிரணியாய நம:' என்று கூறுமாறு சொன்னபோது பிரகலாதன் கூறியது யாது ?",
"ஹிரணியன் எடுத்த முடிவு என்ன ?",
"ஹிரணியன் ஏவலர்களை அழைத்து இட்ட கட்டளை யாது ?",
"அரச கட்டளை ஏற்று ஏவலர்கள் பிரகலாதனைக் கொல்ல மேற்கொண்ட முயற்சிகள் யாவை ? திருமாலால் முயற்சிகள் எவ்வாறு முறியடிக்கபட்டன ?",
"ஏவலர்கள் இரணியனிடம் பயத்துடன் கூறிய செய்தி யாது ?",
"ஏவலர்கள் கூறியதைக் கேட்டு ஹிரணியன் செய்த முடிவு எளன ?",
"ஹிரண்யன் பிரகலாதனை நோக்கி என்ன வினவினான் ?",
"உன் இறைவன் யார் ? பிரகலாதன் இதற்குக் கூறிய பதில் யாது ?",
"ஹிரணியன் தூணை உடைத்ததும் என்ன நடந்தது ?",
"நரசிங்கராகிய திருமால் என்ன செய்தார் ?",
"பிரகலாதன் என்ன செய்து கொண்டு இருந்தான் ?",
"நரசிங்கராகிய திருமால் என்ன செய்தார் ?",
"கொடிய அசுரன் அழிந்ததால் விண்ணவரும் மண்ணவரும் என்ன செய்தனர் ?",
"நரசிங்கரின் கோபம் தணியாவிட்டால் என்ன நேரும் என்று தேவர்கள் பயந்தனர் ?",
"நரசிங்கரின் கோபத்தை சாந்தப்படுத்தியவர் யார் ?",
"திருமாலிடம் பிரகலாதன் வேண்டிய வரம் யாது ?",
"திருமால் பிரகலாதனுக்குக் கொடுத்த ஆசிர்வாதங்கள் என்ன ?",
"திருமங்கையாழ்வார் நரசிம்மாவதாரத்தைக் குறிப்பிடும் திருவல்லிக்கேணி பாசுரத்தைக் கூறுக.",
"திருமங்கையாழ்வாரின் ஸ்வீகாரப் பிள்ளை என்று பெரியவாச்சான் பிள்ளை யாரைக் குறிப்பிடுகிறார் ?",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1"];

var mudhalans = 
[
"அளவற்ற வரங்கள் பெற்றிருந்தும், ஹிரண்யன் தம்பி - ஹிரண்யாட்சன் திருமாலால் அழிக்கப் பெற்றதால். ",
"திருமாலை எதிர்க்கவும், தன் திறமையை மேலும் வளர்த்துக் கொள்ளவும் கடும் தவம் புரிந்தான்.",
"எந்த உயிராலும், பொருளாலும், உள்ளேயோ, வெளியிலேயோ, பகலிலேயோ, இரவிலேயோ, பூமி, ஆகாயம், இவற்றில் மரணம் சம்பவிக்க கூடாது. ஆயுதங்களோ, பிராணிகளோ, மனிதர்களோ, தேவர்களோ, அசுரர்களோ என்னுயிரைப் பிரிக்க கூடாது என்று யாராலும் வெல்ல முடியாத வரத்தை வேண்டினான். பிரம்மனும் அளித்தான்.",
"தேவர்களுக்கு ஹவிர்ப்பாகம் அளிக்க கூடாது. தனக்கே அளிக்க வேண்டும் என்று கட்டளையிட்டான்.",
"இரணியன் செய்த கொடுமையில் பூமியிலிருந்து அவர்களுக்கு அவிர்ப்பாகம் கிடைக்கவில்லை, எங்களை காப்பாற்றுங்கள் என்று சரண் அடைந்தனர். ",
"'ஓம் நமோ நாராயணாய' என்று பக்தியோடு உச்சரித்த வாய்களிலிருந்து 'ஓம் ஹிரணியாய நம:' என்ற வார்த்தை உதறலோடு உச்சரிக்கப்படுவதைக் கண்டார். ",
"நான்கு பிள்ளைகள். ",
"ப்ரஹ்லாதன். ",
"கயாது ",
"நாரதர்",
"சுக்ராசாரியார்",
"சண்டன், மார்கன் ",
"ஹிரணியன் பிள்ளைகளுக்கும் மற்றவர்களுக்கும் கல்வி போதித்து வந்தனர்.",
"இறைவனுக்கு அடுத்தபடியாகத் தான் மாதா, பிதா, குரு எல்லாம். எனவே என் இறைவன் நாராயணன் நாமத்தையே கூறுவேன் என்று கூறி “ஒம் நமோ நாராயணாய” என்று கூறினான். ",
"பிரகலாதன் தன்னை ஆண்டவனாக எண்ணிப் போற்றச் செய்தாக வேண்டும் என்று முடிவு செய்தான். ",
"'ஹிரணியாய நம:' என்று பிரகலாதன் கூற வேண்டும் இல்லையேல் அவனை உயிரை அழித்து விட கட்டளை ஈட்டான். ",
"1. படைக்கலங்களை வீசினர். அவை தூளாகின. 2. தீயில் தள்ளினார்கள். தீநாக்கு தீண்டியபோது மலர்கள் உரசியது போல் இருந்தது. 3. மதயானையை ஏவி விட்டனர். வேழம் பிரகலாதன் முன் மண்டியிட்டது. 4. தந்தங்களால் உடலில் குத்தினர். தந்தங்கள் உடைந்து போயின. 5. பெரிய கல்லில் கட்டி கடலில் வீசினர். கனம் மிகுந்த கல்லுடன் பிரகலாதனும் மிதந்து வந்தான். 6. கொடிய விஷம் அளிக்கப்பட்டது. கொடிய விஷமும் அமுதமாக மாறியது. ",
"எத்தனையோ விதங்களில் முயன்றும் பிரகலாதனைக் கொல்ல முடியாமல் தோற்றுபோனதை வேதனையோடும் பயத்தோடும் கூறினர்.",
"தானே தன் பிள்ளையைக் கொன்று விடுவது என்று முடிவு செய்தான். ",
"உன் இறைவன் யார் ? காட்டு என்று வினவினான்.",
"இறைவன் உன்னிலும் உள்ளான், என்னிலும் உள்ளான்; தூணிலும் இருப்பான் துரும்பிலும் இருப்பான் என்று கூறினான். ",
"இடி இடித்ததைப் போன்று பேரொலி கேட்டது. தூணைப் பிளந்துகொண்டு, மனித உடலும், சிங்க முகமும், கூரிய நகங்களும் கொண்டு நரசிங்கராக மண்ணுக்கும் விண்ணுக்கும் நெடுக வளர்ந்து நின்றார் திருமால்.",
"அசுரர்களையும், திரண்டு வந்த சேனைகளையும் சின்னாபின்னமாக அழித்தார். ",
"பரந்தாமனின் திருவிளையாடலைப் பார்த்து மகிழ்ந்து கொண்டிருந்தான். ",
"ஹிரணியனைத் தன் கைகளால் எட்டிப் பிடித்து வாயிற்படிக்கு இழுத்துச் சென்று தன் மடி மீது போட்டு, கூரிய நகங்களால் மார்பைப் பிளந்து, குடலைப் பிடுங்கி மாலையாகப் போட்டுக் கொண்டார். குருதியைப் பருகினார். சாகாவரம் பெற்ற அசுரனை அழித்தார். ",
"விண்ணவரும் மண்ணவரும் ஆனந்தக் கூத்தாடினார்கள்.",
"ஜகத்திற்குக் கேடு விளையும் என்று பயந்தனர். ",
"பிரகலாதன். ",
"என்றும் மாறா பக்தியுடன் தங்கள் திருநாமத்தை நான் ஜபித்துக் கொண்டேயிருக்க வேண்டும் என்று வேண்டினான். ",
"அசுரர்களுக்கெல்லாம் அறிவுடைய அரசனாக விளங்க வேண்டும். அருள் நெறியைப் பரப்பி வரவேண்டும். ",
"2-3-8 (பெரிய திருமொழி) பள்ளியில் ஒதி.....",
"பிரஹ்லாதன்.",
"ans9",
"ans7",
"ans7",
"ans8",
"ans9",
"ans7",
"ans8",
"ans9"];

var numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21
    , 22, 23, 24, 25, 26, 27, 28, 29, 30, 31];

function shuffle(o) {
    for(var j, x, i = o.length; i; j = parseInt(Math.random() * i), x = o[--i], o[i] = o[j], o[j] = x);
    return o;
};

var random = shuffle(numbers);
console.log(random);
document.getElementById("question1").innerHTML = "1. " + mudhalques[random[0]];
document.getElementById("question2").innerHTML = "2. " + mudhalques[random[1]];
document.getElementById("question3").innerHTML = "3. " + mudhalques[random[2]];
document.getElementById("question4").innerHTML = "4. " + mudhalques[random[3]];
document.getElementById("question5").innerHTML = "5. " + mudhalques[random[4]];
document.getElementById("question6").innerHTML = "6. " + mudhalques[random[5]];
document.getElementById("question7").innerHTML = "7. " + mudhalques[random[6]];
document.getElementById("question8").innerHTML = "8. " + mudhalques[random[7]];
document.getElementById("question9").innerHTML = "9. " + mudhalques[random[8]];
document.getElementById("question10").innerHTML = "10. " + mudhalques[random[9]];

document.getElementById("answer1").innerHTML = "Ans. " + mudhalans[random[0]];
document.getElementById("answer2").innerHTML = "Ans. " + mudhalans[random[1]];
document.getElementById("answer3").innerHTML = "Ans. " + mudhalans[random[2]];
document.getElementById("answer4").innerHTML = "Ans. " + mudhalans[random[3]];
document.getElementById("answer5").innerHTML = "Ans. " + mudhalans[random[4]];
document.getElementById("answer6").innerHTML = "Ans. " + mudhalans[random[5]];
document.getElementById("answer7").innerHTML = "Ans. " + mudhalans[random[6]];
document.getElementById("answer8").innerHTML = "Ans. " + mudhalans[random[7]];
document.getElementById("answer9").innerHTML = "Ans. " + mudhalans[random[8]];
document.getElementById("answer10").innerHTML = "Ans. " + mudhalans[random[9]];

document.getElementById("showhidebut").style.display = "block"
document.getElementById("refreshQuest").style.display = "block"
document.getElementById("refreshpage").style.display = "block"
}