function periazhwarques() 
{
    functionname ="periazhwar";
    
var mudhalques = 
[
"பெரியாழ்வாரின் இயற்பெயர் யாது ?",
"பெரியாழ்வார் அவதரித்த ஸ்தலம் யாது ?",
"பெரியாழ்வாரின் திருநக்ஷத்திரம் யாது ? அவர் எம்மாதத்தில் அவதரித்தார் ?",
"பெரியாழ்வார் பெண் பிள்ளையின் பெயர் என்ன ?",
"பெரியாழ்வார் என்ன கைங்கர்யம் செய்தார் ?",
"பெரியாழ்வாரின் பிரபந்தங்கள் யாவை ?",
"பெரியாழ்வாரின் எந்தப் பாசுரங்கள் நித்தியானுஸந்தானத்தில் உள்ளன ?",
"திருப்பல்லாண்டில் எத்தனை பாசுரங்கள் உள்ளன ?",
"திருப்பல்லாண்டின் முதல் பாசுரத்திலுள்ள முதல் வார்த்தை எது ?",
"வேதம் ஒதும்போது 'ஓம்' முதலில் வருவது போல் அருளிச்செயல் ஒதும்போது முதலில் வருவது எது ?",
"திருப்பல்லாண்டின் முதல் பாசுரத்தில் யாருக்குப் பல்லாண்டு பாடப்படுகிறது ?",
"திருப்பல்லாண்டின் இரண்டாம் பாசுரத்தில் மங்களாசாசனம் செய்யப்படுபவர்கள் யாவர் ?",
"பெரியாழ்வார் திருமொழியில் எத்தனை பாசுரங்கள் உள்ளன ?",
"பெரியாழ்வார் திருமொழியில் முதற்பாசுரத்திலுள்ள முதல் வார்த்தை எது ?",
"கிருஷ்ணாவதார குணங்களைப் பெரியாழ்வாரின் எந்த நூல் விவரிக்கிறது ?",
"எந்தப் பெருமாள் பெரியாழ்வார் கனவில் தோன்றினார் ?",
"பெரியாழ்வார் எந்த அரச சபையில் தத்துவநிர்ணயம் செய்தார் ?",
"பெரியாழ்வாருக்குச் சூட்டப்பட்ட விருதுப்பெயர் யாது ?",
"பொற்கிழியைப் பெற்ற பின் பெரியாழ்வாருக்கு எம்பெருமான் எப்படி சேவை சாதித்தான் ?",
"பொங்கும் பரிவாலே வில்லிப்புத்தூர் பட்டர்பிரான் பெற்றான் பெரியாழ்வார் என்னும் பெயர் இவ்வாறு அருளிச் செய்தவர் யார் ?",
"பெரியாழ்வார் திருமொழிக்கு உரை அருளிச் செய்தவர்கள் யாவர்?",
"கண்ணனின் தொட்டிலைப் பெரியாழ்வார் எவ்வாறு வர்ணிக்கிறார் ?",
"சக்கரக்கையன் யார் ?",
"சங்கொடுசக்கரம் சார்ங்கமேந்தும் தடக்கையன் யார் ?",
"பாலகனென்று பரிபவம் செய்யேல்! என்று தொடங்கும் பாடலில் பண்டொருநாள் கண்ணன் செய்ததாகப் பெரியாழ்வார் எதைக்கூறுகிறார் ?",
"சிறியனென்று என்னிளஞ்சிங்கத்தை இகழேல் கண்டாய்! சிறுமையின் வார்த்தையை யாரிடம் சென்று கேட்க வேண்டும் என்று பெரியாழ்வார் குறிப்பிடுகிறார் ?",
"தாழியில் வெண்ணெய் தடங்கையார விழுங்கியது யார்?",
"மைத்தடங்கண்ணி யசோதை தன் மகன் யார் ?",
"நான்மறையின் பொருள் யார் ?",
"முன்னையமரர் முதல் தனிவித்து யார் ?",
"பேயின் முலையுண்ட பிள்ளை யார் ?",
"பெருமாள் எதன்மேல் இருப்பதாக பெரியாழ்வார் கூறுகிறார்.",
"கண்கள் கருவுடைமேகங்களை கண்டால் யாரைக்காண்பது போல் உள்ளதாகப் பெரியாழ்வார் கூறுகிறார் ?",
"பெரியாழ்வாருக்கும் சமுத்திர ராஜனுக்குமுள்ள ஒற்றுமை என்ன ?",
"பெரியாழ்வார் திருநாடலங்கரித்தது எவ்விடத்தில் ?",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1"];

var mudhalans = 
[
"விட்டுசித்தர்.",
"ஸ்ரீவில்லிபுத்தூர். ",
"ஆனியில் சுவாதி நட்சத்திரம். ",
"ஆண்டாள். ",
"ஸ்ரீவடபத்ர சாயிக்குப் பூமாலைகளை அணிவித்தார். ",
"திருப்பல்லாண்டு, பெரியாழ்வார் திருமொழி. ",
"நீரோட்டம், பூச்சூடல், காப்பிடல், சென்னியோங்கு.",
"12 பாசுரங்கள். ",
"பல்லாண்டு.",
"திருப்பல்லாண்டு. ",
"மணிவண்ணனான திருமாலுக்குப் பல்லாண்டு பாடப்படுகிறது. ",
"அடியார்கள், திருமால், திருமகள், திருஆழி, திருச்சங்கு.",
"461 பாசுரங்கள் உள்ளன.",
"வண்ணமாடங்கள். ",
"பெரியாழ்வார் திருமொழி. ",
"ஸ்ரீவில்லிப்புத்தூரில் உறையும் வடபத்திரசாயி. ",
"ஸ்ரீவல்லபதேவன் என்கிற பாண்டிய அரசன் சபை. ",
"பட்டர்பிரான். ",
"சங்கு சக்கரமேந்தி ஸ்ரீதேவி பூமிதேவியுடன் கருடன் மேல் சேவை சாதித்தான்.",
"மணவாள மாமுனிகள். ",
"முதல் நானூறு பாசுரங்களுக்குப் பெரியவாச்சான் பிள்ளை அருளிச்செய்த உரை கிடைக்காமற்போகவே மணவாளமாமுனிகள் அவற்றிற்கு உரை எழுதியருளினார். மற்ற 61 பாட்டுக்களுக்குப் பெரியவாச்சான்பிள்ளை உரை உள்ளது. திருவாய்மொழிப் பிள்ளையும் உள்ளுறைப் பொருள் வழங்கியதாகக் கூறப்படுகிறது. ",
"ஆணிப்பொன்னால் செய்த வண்ணச்சிறுத் தொட்டில் என்று வர்ணிக்கிறார். ",
"பெருமாள். ",
"ஸ்ரீமன் நாராயணன். ",
"ஆலினிலை வளர்ந்த சிறுக்கனவன் இவன் என்று பெரியாழ்வார் கூறுகின்றார். ",
"மாவலியிடம். ",
"கண்ணன். ",
"(நாராயணன்) கண்ணன்.",
"நாராயணன். நம்முடைய நாயகன், உலகளந்த பெருமாள், கண்ணன் ",
"நாராயணன். ",
"கண்ணன்.",
"ஆலத்திலையான், அரவினணைமேலான்.",
"திருவரங்கத்தம்மானை.",
"இருவரும் எம்பெருமானின் மாமனார் ஆகின்றனர். ",
"திருமாலிருஞ்சோலை மலையில்.",
"ans7",
"ans8",
"ans9",
"ans7",
"ans8",
"ans9",
"ans7",
"ans8",
"ans9",
"ans7",
"ans8",
"ans9"];

var numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21
, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34];

function shuffle(o) {
    for(var j, x, i = o.length; i; j = parseInt(Math.random() * i), x = o[--i], o[i] = o[j], o[j] = x);
    return o;
};

var random = shuffle(numbers);
console.log(random);
document.getElementById("question1").innerHTML = "1. " + mudhalques[random[0]];
document.getElementById("question2").innerHTML = "2. " + mudhalques[random[1]];
document.getElementById("question3").innerHTML = "3. " + mudhalques[random[2]];
document.getElementById("question4").innerHTML = "4. " + mudhalques[random[3]];
document.getElementById("question5").innerHTML = "5. " + mudhalques[random[4]];
document.getElementById("question6").innerHTML = "6. " + mudhalques[random[5]];
document.getElementById("question7").innerHTML = "7. " + mudhalques[random[6]];
document.getElementById("question8").innerHTML = "8. " + mudhalques[random[7]];
document.getElementById("question9").innerHTML = "9. " + mudhalques[random[8]];
document.getElementById("question10").innerHTML = "10. " + mudhalques[random[9]];

document.getElementById("answer1").innerHTML = "Ans. " + mudhalans[random[0]];
document.getElementById("answer2").innerHTML = "Ans. " + mudhalans[random[1]];
document.getElementById("answer3").innerHTML = "Ans. " + mudhalans[random[2]];
document.getElementById("answer4").innerHTML = "Ans. " + mudhalans[random[3]];
document.getElementById("answer5").innerHTML = "Ans. " + mudhalans[random[4]];
document.getElementById("answer6").innerHTML = "Ans. " + mudhalans[random[5]];
document.getElementById("answer7").innerHTML = "Ans. " + mudhalans[random[6]];
document.getElementById("answer8").innerHTML = "Ans. " + mudhalans[random[7]];
document.getElementById("answer9").innerHTML = "Ans. " + mudhalans[random[8]];
document.getElementById("answer10").innerHTML = "Ans. " + mudhalans[random[9]];

document.getElementById("showhidebut").style.display = "block"
document.getElementById("refreshQuest").style.display = "block"
document.getElementById("refreshpage").style.display = "block"
}