function ramanujarques() 
{
    functionname ="ramanujar";
    
var mudhalques = 
[
"ராமானுஜர் வரதராஜப்பெருமாளுக்கு எந்தக்கிணற்றில் இருந்து தீர்த்தம் கொணர்ந்தார் ?",
"யாதவப்பிரகாசர் ராமானுஜரை அழிக்க மேற்கொண்ட உபாயம் யாது ?",
"காஞ்சியில் இருந்து ராமானுஜர் திருவரங்கம் வருவதற்குத் திருவரங்கராஜன் யாரை அனுப்பினான் ?",
"யார் அமுது செய்த மிகுதியை ராமானுஜர் அமுது செய்ய விரும்பினார் ?",
"ராமானுஜரின் சிறிய தாயார் மகனின் பெயர் என்ன ?",
"ராமானுஜரின் மருமகன் யார் ?",
"காஞ்சியில் ராமானுஜர் இருந்த போது அவரை ஆசார்யராகக் கொண்டவர்கள் யாவர் ?",
"ராமானுஜரிடம் வாதிட்டுப் பின்பு வைஷ்ணவரான ஆசார்யர் யார் ?",
"விஷ்ணுசித்தரை எங்களாழ்வான் என்று பெயரிட்டு முதன்முதலில் அழைத்தவர் யார் ?",
"ராமானுஜரின் பெற்றோர்கள் யாவர் ?",
"ராமானுஜரின் வேதாந்த கிரந்தங்கள் எத்தனை ?",
"ராமானுஜர் இயற்றிய நூல்களைக் கூறுக ?",
"ராமானுஜரின் வேறு பெயர்களை எழுதுக.",
"ராமானுஜர் எத்தனை ஆண்டுகள் வாழ்ந்திருந்தார் ?",
"ராமானுஜருக்குத் துவயமந்திர உபதேசம் செய்தவர் யார் ?",
"ராமானுஜரின் ஆசார்யர்கள் எத்தனை பேர் ? அவர்கள் யாவர் ?",
"இராமானுஜர், வேதாந்தப் பாடத்தை எந்த ஊரில் யாரிடத்தில் வாசித்தார் ?",
"ராமானுஜர் எந்த மொழியில் நூல்களை எழுதினார் ?",
"ராமானுஜரை, 'கோயிலண்ணரே' என்று அழைத்தவர் யார் ?",
"பூலோகத்தில் ராமானுஜரின் முன் அவதாரங்கள் யாவை ?",
"கோவிந்த ஜீயர் என்னும் பெயரை அடைந்தவர் யார் ?",
"எம்பெருமானாருடைய தண்டமாகவும், பவித்ரமாகவும் கருதப்படுபவர் யாவர் ?",
"எம்பெருமானுக்குத்திருவாராதனம் செய்யும் முறையைக் கூறும் ராமானுஜரின் நூல் எது ?",
"ராமானுஜரைப் பற்றிய பிரசித்தமான தமிழ் நூல் எது ?",
"இராமானுச நூற்றந்தாதியை இயற்றியவர் யார்",
"எம்பெருமானார் தரிசனம் என்று பேரிட்டு நாட்டிவைத்தவர் யார் ?",
"ராமானுஜரின் ஞான புத்திரர் யார் ?",
"ராமானுஜர் மந்த்ரார்த்தங்களைப் பெறத் திருக்கோட்டியூருக்கு எத்தனை முறை நடந்தார் ?",
"எம்பெருமானாரால் நியமிக்கப்பட்ட ஸிம்மாசனாதிபதிகள் எத்தனை பேர் ?",
"எம்பாரின் தம்பி பெயர் என்ன ?",
"சிறிய கோவிந்தப் பெருமாளின் திருக்குமாரர் பெயர் என்ன ?",
"ராமானுஜரின் பாத நிழல் என்று கூறப்படுபவர் யார் ?",
"எம்பாருக்கு பஞ்சஸம்ஸ்காரம் செய்தவர் யார் ?",
"ஸ்ரீ வைஷ்ணவர்கள் ராமானுஜரின் ஆசார்யர்களுக்குச் சமமாக மதித்த மற்றொருவர் யார் ?",
"உள்ளங்கைக்கொணர்ந்த நாயனார் என்று குறிக்கப்பட்டவர் யார் ?",
"எம்பெருமானாருக்கு அடுத்த ஓராண்வழி ஆசார்யர் யார் ?",
"திருவரங்கத்தமுதனாரின் ஆசார்யர் யார் ?",
"தரிசனத்திற்காகத் தம் நேத்ரத்தையிழந்தவர் யார் ?",
"திருமலையில் நந்தவனக் கைங்கர்யத்தில் ஈடுபட்டவர் யார் ?",
"எங்களாழ்வான் அவதார ஸ்தலம் எது ?",
"பட்டருடைய பேரவையில் இருந்த தமிழ்ப்புலவர்கள் இருவரைக் கூறுக ?",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1"];

var mudhalans = 
[
"சாலைக்கிணறு. ",
"கங்கையில் தள்ளி முடித்தல். ",
"திருவரங்கப்பெருமாள் அரையர். ",
"திருக்கச்சி நம்பிகள். ",
"கோவிந்தன். ",
"தாசரதி என்கிற முதலியாண்டான்.",
"கூரத்தாழ்வான், முதலியாண்டான். ",
"அருளாளப்பெருமாள் எம்பெருமானார் (யஜ்ஞமூர்த்தி). ",
"ராமானுஜர்.",
"தந்தை கேசவசோமயாஜி, தாய் பூமிப்பிராட்டி என்கிற காந்திமதி அம்மையார். ",
"ஐந்து.",
"1. வேதாந்த தீபம் 2. வேதாந்த சாரம் 3. வேதார்த்த ஸங்கிரஹம் 4. ஸ்ரீபாஷ்யம் 5. கீதாபாஷ்யம் 6. சரணாகதி கத்யம் 7. ஸ்ரீரங்க கத்யம் 8. வைகுண்டகத்யம் 9. நித்யம்",
"1. இளையாழ்வார் 2. எம்பெருமானார் 3. கோயில் அண்ணர் 4. யதிராஜர் 5. உடையவர் 6. ஸ்ரீபாஷ்யகாரர் 7. லஷ்மணமுனி ",
"120. (கி.பி. 1017 - 1137) ",
"பெரியநம்பிகள், மதுராந்தகத்தில். ",
"ஐவர், 1) பெரிய நம்பிகள், 2) பெரியதிருமலை நம்பி, 3) திருக்கோட்டியூர் நம்பிகள், 4) திருவரங்கப்பெருமாள் அரையர், 5) திருமாலை ஆண்டான்",
"காஞ்சிக்கு அடுத்து திருப்புட்குழியில் யாதவப்பிரகாசரிடத்தில். ",
"ஸம்ஸ்கிருதத்தில். ",
"ஸ்ரீவில்லிபுத்தூர் ஆண்டாள். ",
"ஆதிசேஷன், லஷ்மணன், பலராமன். ",
"யாதவப்ரகாசர். ",
"முதலியாண்டானும், கூரத்தாழ்வானும். ",
"நித்யகிரந்தம். ",
"இராமானுச நூற்றந்தாதி. ",
"திருவரங்கத்தமுதனார். ",
"நம்பெருமாள். ",
"திருக்குருகைப்பிரான் பிள்ளான். ",
"18 முறை .",
"74 பேர். ",
"சிறிய கோவிந்தப்பெருமாள். ",
"ஸ்ரீபராங்குச நம்பி. ",
"எம்பார். ",
"பெரியதிருமலைநம்பி. ",
"திருக்கச்சி நம்பிகள்.",
"கோவிந்தர் என்ற எம்பார். ",
"எம்பார். ",
"கூரத்தாழ்வான். ",
"கூரத்தாழ்வான். ",
"அனந்தாழ்வான். ",
"திருவெள்ளறை. ",
"ஆலவாயுடையான், ஒப்பிலாத பெருமாள்.",
"ans8",
"ans8",
"ans8",
"ans7",
"ans8",
"ans8",
"ans8",
"ans7",
"ans8",
"ans8",
"ans8",
"ans7",
"ans8",
"ans8",
"ans8",
"ans7",
"ans8",
"ans8",
"ans9",
"ans7",
"ans8",
"ans9"];

var numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21
    , 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40];

function shuffle(o) {
    for(var j, x, i = o.length; i; j = parseInt(Math.random() * i), x = o[--i], o[i] = o[j], o[j] = x);
    return o;
};

var random = shuffle(numbers);
console.log(random);
document.getElementById("question1").innerHTML = "1. " + mudhalques[random[0]];
document.getElementById("question2").innerHTML = "2. " + mudhalques[random[1]];
document.getElementById("question3").innerHTML = "3. " + mudhalques[random[2]];
document.getElementById("question4").innerHTML = "4. " + mudhalques[random[3]];
document.getElementById("question5").innerHTML = "5. " + mudhalques[random[4]];
document.getElementById("question6").innerHTML = "6. " + mudhalques[random[5]];
document.getElementById("question7").innerHTML = "7. " + mudhalques[random[6]];
document.getElementById("question8").innerHTML = "8. " + mudhalques[random[7]];
document.getElementById("question9").innerHTML = "9. " + mudhalques[random[8]];
document.getElementById("question10").innerHTML = "10. " + mudhalques[random[9]];

document.getElementById("answer1").innerHTML = "Ans. " + mudhalans[random[0]];
document.getElementById("answer2").innerHTML = "Ans. " + mudhalans[random[1]];
document.getElementById("answer3").innerHTML = "Ans. " + mudhalans[random[2]];
document.getElementById("answer4").innerHTML = "Ans. " + mudhalans[random[3]];
document.getElementById("answer5").innerHTML = "Ans. " + mudhalans[random[4]];
document.getElementById("answer6").innerHTML = "Ans. " + mudhalans[random[5]];
document.getElementById("answer7").innerHTML = "Ans. " + mudhalans[random[6]];
document.getElementById("answer8").innerHTML = "Ans. " + mudhalans[random[7]];
document.getElementById("answer9").innerHTML = "Ans. " + mudhalans[random[8]];
document.getElementById("answer10").innerHTML = "Ans. " + mudhalans[random[9]];

document.getElementById("showhidebut").style.display = "block"
document.getElementById("refreshQuest").style.display = "block"
document.getElementById("refreshpage").style.display = "block"
}