function section8ques() 
{
    functionname ="section8";
    
var mudhalques = 
[
"பஞ்சஸ்தவங்கள் யாவை ?",
"அஷ்டச்லோகீ என்னும் நூலை இயற்றியவர் யார் ?",
"துவாபர யுகத்தில் அவதரித்த ஆழ்வார்கள் யாவர் ?",
"திருக்குளந்தை என்னும் திவ்ய தேசத்தின் மறுபெயர் என்ன ?",
"நம்பெருமாள் என்று யாரை அழைக்கிறோம் ?",
"அழகிய மணவாளன் என்று எந்த பெருமாளை அழைக்கிறோம் ?",
"ஸ்ரீரங்கத்தின் ஸ்தல விருக்ஷம் எது ?",
"பூலோக வைகுண்டம் எது ?",
"கம்பராமாயண அரங்கேற்றம் எங்கு நடந்தது ?",
"கம்பராமாயணத்தை ஆமோதித்தவர் யார் ?",
"திருக்காழிச்சீராம விண்ணகரத்தின் மறு பெயர் என்ன ?",
"ஜடாயுவுக்கு இறுதிச்சடங்குகளை செய்தவர் யார் ?",
"ராமாயணத்தில் மாயமானாக வந்தவன் யார் ?",
"வாயுகுமாரர் யார் ?",
"ஸம்பிரதாயத்தில் சிறிய திருவடி என்று அழைக்கப்படுபவர் யார் ?",
"ஆதிசேஷன் பெருமாளுக்கு அண்ணனாக அவதரித்த அவதாரம் எது ?",
"ஆதிசேஷன் பெருமாளுக்குத் தம்பியாக அவதரித்த அவதாரம் எது ?",
"ராமர் ஒரே அம்பினால் எத்தனை மரங்களை வீழ்த்தினார் ?",
"சுதாமா யாருடைய நண்பர் ?",
"பிரம்மாவின் தலையைக் கிள்ளியதால் சிவனுக்கு வந்த தோஷம் எது ?",
"கண்ணன் அவதரித்த மாதம், நக்ஷத்திரம் எது ?",
"ஸ்ரீபெரும்புதூரின் மறுபெயர் என்ன ?",
"தேவர்கள் கூடிய இடம் எது ?",
"கண்ணன் வதம் செய்த யானையின் பெயர் என்ன ?",
"4 புருஷார்த்தங்களைக் கூறுக ?",
"மஹாபாரதத்தில் 'பிதாமஹர்' யார் ?",
"பார்த்தன் பள்ளிப்பெருமாள் பெயர் என்ன ?",
"பாண்டிய நாட்டு திவ்ய தேசங்கள் எத்தனை ?",
"சோழநாட்டு திவ்ய தேசங்கள் எத்தனை ?",
"ஆழ்வார் திருநகரியில் நான்கு உற்சவங்களும் தொடர்ந்து எந்தெந்த மாதங்களில் நடக்கின்றன ?",
"விபூதிகள் எத்தனை ?",
"புராணங்களுக்குள்ளே சிறந்தது எது ? ",
"புராணங்கள் எத்தனை ?",
"ஆழ்வார் திருநகரியின் பெருமாள் பெயர் என்ன ?",
"வேதத்தில் சிறந்த பகுதி எது ?",
"தர்மசாஸ்திரங்களில் சிறந்தது எது ?",
"மஹாபாரதத்தில் சிறந்த பகுதிகள் எவை ?",
"திருக்கண்ணபுரம் பெருமாள் பெயர் என்ன ?",
"பரமபதத்தில் எந்தெந்த ஜீவர்கள் இருப்பார்கள் ?",
"ஸ்ரீவைஷ்ணவர்கள் அனைவருக்கும், பஞ்சஸம்ஸ்கார காலத்தில் ஆசார்யனாலே சிஷ்யனுக்கு எந்தெந்த ரஹஸ்ய மந்திரங்கள் உபதேசிக்கப்படுகின்றன ?",
"ரஹஸ்யத்ரயத்தில் அஷ்டாக்ஷரமந்திரம் எது ?",
"தென் நாடும், வடநாடும் தொழும் திருத்தலம் எது ?",
"விண்ணோர்க்கும் மண்ணோர்க்கும் வைப்பு எது ?",
"எந்த ஊர் நாலாயிரகோஷ்டியில் உபதேச ரத்தின மாலையை நாலாயிரத்தின் ஒரு பகுதியாகவே கருதி சேவித்து வருகிறார்கள் ?",
"திவ்ய தேசங்களில் நேபாள நாட்டில் உள்ள திவ்யதேசம் எது ?",
"'ஒப்பிலா மாதர்கள் வாழும் திவ்ய தேசம்' என்று திருமங்கையாழ்வார் எதைக் குறிப்பிடுகிறார் ?",
"நம்பெருமாள் ரத்னாங்கியை எந்த நாளில் சாற்றிக் கொள்கிறார் ?",
"புராணரத்தினமான ஸ்ரீவிஷ்ணு புராணத்தை இயற்றியவர் யார் ?",
"ஐந்தாவது வேதம் என்று எதைக் குறிப்பிடுகிறோம் ?",
"வியாசர் யாருடைய அம்சமாய் அவதரித்தார் ?",
"வராஹசரமச்லோகத்தை அருளியவர் யார் ?",
"ஸ்ரீராமசரமச்லோகத்தை அருளியவர் யார் ?",
"கீதாசரமச்லோகத்தை அருளியவர் யார் ?",
"பகவான் திருமந்திரத்தை யாருக்கு உபதேசித்தான் ?",
"பகவான் த்வய மந்திரத்தை யாருக்கு உபதேசித்தான் ?",
"பகவான் சரமச்லோகத்தை யாருக்கு உபதேசித்தான் ?",
"மதத்திரயங்கள் என்பவை யாவை ?",
"விசிஷ்டாத்வைத மதத்திற்கு நம்பெருமாள் இட்ட பெயர் என்ன ?",
"நித்யசூரிகள் சிலரைக் கூறுக.",
"பிரம்மாவின் மானஸ புத்திரர்கள் யாவர் ?",
"யுகங்கள் யாவை ?",
"பகவந் மந்திரங்களில் இரண்டு வகை எவை ?",
"நம்பெருமாளை எத்தனை ஆழ்வார்கள் பாடியுள்ளனர் ?",
"நாலு அரசுகள் யாவை ?",
"வேதத்தின் அங்கங்கள் யாவை ?",
"நான்கு வேதங்கள் யாவை ?",
"வசிஷ்டரின் மகன் யார் ?",
"சக்தியின் திருக்குமாரர் யார் ?",
"பராசரரின் திருக்குமாரர் யார் ?",
"வியாசரின் திருக்குமாரர் யார் ?",
"மஹாபாரதத்தை இயற்றியவர் யார் ?",
"மஹாபாரதத்தை ஜனமேஜயனுக்கு யார் உபதேசித்தார் ?",
"வைணவ ஸம்பிரதாயத்தில், 'பெரிய கோவில்' எது ?",
"பெரிய பிராட்டியார் யார் ?",
"பெரிய பெருமாள் யார் ?",
"யசோதையின் பாவனையில் பாசுரங்கள் அமைத்த ஆழ்வார்கள் யாவர் ?",
"தேவகி, தசரதன் அவர்கள் நிலையில் நின்று பாடிய ஆழ்வார் யார் ?",
"ஆயர் குலச் சிறுமியர் பாவனையில் பாசுரங்கள் இயற்றிய ஆழ்வார்கள் யாவர் ?",
"திருமங்கை மன்னன் திருவரங்கத்தில் செய்த கைங்கர்யங்கள் எவை ?",
"தென்திருப்பேரையில் கருடன் சன்னதி விலகியிருப்பதேன் ?",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1"];

var mudhalans = 
[
"வரதராஜஸ்தவம், ஸ்ரீஸ்தவம், அதிமானுஷஸ்தவம், சுந்தரபாஹுஸ்தவம், ஸ்ரீவைகுண்டஸ்தவம். ",
"ஸ்ரீ பராசரபட்டர். ",
"பொய்கையாழ்வார், பூதத்தாழ்வார், பேயாழ்வார், திருமழிசைப்பிரான், மதுரகவிகள்.",
"பெருங்குளம். ",
"ஸ்ரீரங்கநாதர் (உற்சவமூர்த்தி). ",
"ஸ்ரீ ரங்கநாதர்.",
"புன்னை மரம். ",
"ஸ்ரீரங்கம். ",
"ஸ்ரீரங்கம் ரங்கநாதர் கோயிலில்.",
"மேட்டு அழகிய சிங்கர்.",
"சீர்காழி. ",
"ஸ்ரீராமர். ",
"மாரீசன். ",
"ஹனுமான்.",
"ஹனுமான்.",
"பலராமன். ",
"லஷ்மணன். ",
"ஏழு மரங்களை. ",
"கண்ணன்.",
"பிரம்ம ஹத்தி தோஷம். ",
"ஆவணி, ரோஹிணி. ",
"பூதபுரி.",
"திருக்கோட்டியூர். ",
"குவலயாபீடம். ",
"தர்மம், அர்த்தம், காமம், மோக்ஷம்.",
"பீஷ்மர். ",
"பார்த்தசாரதி. ",
"பதினெட்டு.",
"நாற்பது. ",
"மாசி, வைகாசி - ஆழ்வார். பங்குனி, சித்திரை - பெருமாள். ",
"நித்ய விபூதி, லீலா விபூதி ஆகிய இரண்டு.",
"விஷ்ணு புராணம்.",
"பதினெட்டு. ",
"ஆதிநாதர். ",
"புருஷசூக்தம். ",
"மனுதர்மசாஸ்திரம். ",
"பகவத் கீதை, விஷ்ணு ஸஹஸ்ரநாமம். ",
"செளரிராஜப்பெருமாள். ",
"நித்யர்களும், முக்தர்களும். ",
"ரஹஸ்யத்ரயம் என்னும் திருமந்திரம், த்வயம், சரமச்லோகம் ஆகியவை.",
"திருமந்திரம்.",
"திருவரங்கம்.",
"திருவேங்கடம். ",
"காஞ்சீபுரம் தேவப்பெருமாள் ஸன்னிதியில். ",
"சாளக்கிராமம். ",
"திருவல்லிக்கேணி. ",
"வைகுண்ட ஏகாதசி என்னும் பெரிய திருநாளில். ",
"பராசரர். ",
"மஹாபாரதம். ",
"விஷ்ணு.",
"ஸ்ரீவராஹப்பெருமாள்.",
"ஸ்ரீராமர். ",
"பகவான் ஸ்ரீகிருஷ்ணர். ",
"தன் அம்ச பூதனான நரனுக்கு. ",
"தன் துணைவியான ஸ்ரீமஹாலஷ்மிக்கு. ",
"தன்னை ஆச்ரயித்தவனான அர்ஜுனனுக்கு. ",
"அத்வைதம், த்வைதம், விசிஷ்டாத்வைதம். ",
"எம்பெருமானார் தரிசனம். ",
"திருவநந்தாழ்வான், கருடாழ்வான், விஷ்வக்சேநர். ",
"ஸநகாதியர். ",
"கிருதயுகம், திரேதாயுகம், துவாபரயுகம், கலியுகம். ",
"வியாபகமந்திரங்கள், அவ்வியாபக மந்திரங்கள். ",
"பத்து ஆழ்வார்களும், ஆண்டாளும் பாடியுள்ளார்கள்.",
"1. தெய்வங்களுக்கு அரசு - நாராயணன் 2. ஆலி நாட்டரசு - திருமங்கையாழ்வார் 3. மந்திரங்களுக்கு அரசு - திருமந்திரம் 4. மரங்களுக்கு அரசு - அரசமரம்",
"1. சிக்ஷா 2. வியாகரணம் 3. சந்தஸ் 4. நிருக்தம் 5. ஜோதிஷம் 6. கல்பம் ",
"ருக், யஜுர், ஸாம, அதர்வண வேதங்கள். ",
"சக்தி. ",
"பராசரர்.",
"வியாசர். ",
"சுகப்பிரம்மம்.",
"வியாசர்.",
"வைசம்பாயநர். ",
"ஸ்ரீரங்கம். ",
"ஸ்ரீரங்கநாச்சியார். ",
"ஸ்ரீரங்கநாதன். ",
"பெரியாழ்வார், திருமங்கையாழ்வார். ",
"குலசேகரப்பெருமாள். ",
"பெரியாழ்வார், ஆண்டாள், நம்மாழ்வார், குலசேகரர், திருமங்கை மன்னன். ",
"காவிரிக்கரையில் திருத்துறை ஏற்படுத்தியமை. திருமதில் எடுத்தமை, திருஅத்யயநஉத்ஸவம் நடத்தியமை. ",
"அத்திருப்பதிப் பாசுரத்தில் நம்மாழ்வார் விவரித்துள்ளவாறு சிறுவர்கள் விளையாட்டை எம்பெருமான் பார்த்து மகிழ்வதற்காக.",
"ans8",
"ans8",
"ans9",
"ans8",
"ans9",
"ans7",
"ans8",
"ans9",
"ans7",
"ans8",
"ans9"];

var numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21
, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43,
44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66,
67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79];

function shuffle(o) {
    for(var j, x, i = o.length; i; j = parseInt(Math.random() * i), x = o[--i], o[i] = o[j], o[j] = x);
    return o;
};

var random = shuffle(numbers);
console.log(random);
document.getElementById("question1").innerHTML = "1. " + mudhalques[random[0]];
document.getElementById("question2").innerHTML = "2. " + mudhalques[random[1]];
document.getElementById("question3").innerHTML = "3. " + mudhalques[random[2]];
document.getElementById("question4").innerHTML = "4. " + mudhalques[random[3]];
document.getElementById("question5").innerHTML = "5. " + mudhalques[random[4]];
document.getElementById("question6").innerHTML = "6. " + mudhalques[random[5]];
document.getElementById("question7").innerHTML = "7. " + mudhalques[random[6]];
document.getElementById("question8").innerHTML = "8. " + mudhalques[random[7]];
document.getElementById("question9").innerHTML = "9. " + mudhalques[random[8]];
document.getElementById("question10").innerHTML = "10. " + mudhalques[random[9]];

document.getElementById("answer1").innerHTML = "Ans. " + mudhalans[random[0]];
document.getElementById("answer2").innerHTML = "Ans. " + mudhalans[random[1]];
document.getElementById("answer3").innerHTML = "Ans. " + mudhalans[random[2]];
document.getElementById("answer4").innerHTML = "Ans. " + mudhalans[random[3]];
document.getElementById("answer5").innerHTML = "Ans. " + mudhalans[random[4]];
document.getElementById("answer6").innerHTML = "Ans. " + mudhalans[random[5]];
document.getElementById("answer7").innerHTML = "Ans. " + mudhalans[random[6]];
document.getElementById("answer8").innerHTML = "Ans. " + mudhalans[random[7]];
document.getElementById("answer9").innerHTML = "Ans. " + mudhalans[random[8]];
document.getElementById("answer10").innerHTML = "Ans. " + mudhalans[random[9]];

document.getElementById("showhidebut").style.display = "block"
document.getElementById("refreshQuest").style.display = "block"
document.getElementById("refreshpage").style.display = "block"
}