function section7ques() 
{
    functionname ="section7";
    
var mudhalques = 
[
"ஸ்ரீ வைஷ்ணவ சம்பிரதாயத்தில் முதல் ஆசார்யர் யார் ?",
"எம்பெருமான் முதல் ஆசார்யன் என்பதைக் கூறும் தனியன் எது ?",
"பரத்வத்தில் மண்டிக்கிடக்கும் ஆழ்வார்கள் யாவர் ?",
"அந்தர்யாமித்துவத்திலே மண்டிக்கிடக்கும் ஆழ்வார் யார் ?",
"கிருஷ்ணாவதாரத்திலே மண்டிக்கிடக்கும் ஆழ்வார்கள் யாவர் ?",
"ராமாவதாரத்திலே மண்டிக்கிடக்கும் ஆழ்வார் யார் ?",
"அர்ச்சாவதார விசேஷமான திருவரங்கத்திலே மண்டிக்கிடக்கும் ஆழ்வார்கள் யாவர் ?",
"ஸ்ரீயான மஹாலக்ஷ்மியை மார்பிலே தரித்திருப்பவன் என்ற பெயருடைய திருநாமம் எது ?",
"பெருமாளின் ஐந்து நிலைகள் யாவை ?",
"அர்ச்சாவதார சாமான்யத்திலே மண்டிக்கிடக்கும் ஆழ்வார் யார் ?",
"நம்பாடுவான் சரித்திரம் நிகழ்ந்த ஸ்தலம் எது ?",
"'முசலகிசலயம்' என்ற வார்த்தை யாருடைய வரலாற்றில் சம்பந்தப்பட்டது ? அதன் பொருள் யாது ?",
"கோயில் கந்தாடை நாயனால் இயற்றப்பட்ட நூல் எது ?",
"பட்டர் வாதில் வென்ற வேதாந்தி பெயர் என்ன ?",
"பட்டர் திருக்கோட்டியூரில் வாழ்ந்த காலத்தில் அவருடன் வாழ்ந்த முக்கிய சிஷ்யர்கள் இருவர் யார் ?",
"பெரியநம்பிகள் ராமானுஜரை சிஷ்யராக ஏற்றருளிய ஊர் எது ?",
"பஞ்சமோபாயநிஷ்டையை உடையவருக்கு அருளிச்செய்தவர் யார் ?",
"யஜ்ஞமூர்த்திக்கு எம்பெருமானார் சூட்டிய திருநாமம் எது ?",
"ராமானுஜர் யாருடைய அவதாரம் ?",
"ஆதிசேஷனின் மற்றொரு பெயர் என்ன ?",
"தற்போது அரையர்கள் சேவை நடக்கும் திவ்ய தேசங்கள் யாவை?",
"கம்சன் யார் ?",
"ஆசார்யர்களுடைய வியாக்கியானங்கள் பொதுவாக எந்த நடையில் அமைந்துள்ளன ?",
"பகவத்விஷய காலக்ஷேபம் என்று எதைக் கூறுகிறோம் ?",
"கருடவாஹன பண்டிதர் இயற்றிய நூல் எது ?",
"யதீந்திரப்ரவண பிரபாவம், ராமானுஜார்ய திவ்யசரிதை ஆகிய நூல்களை இயற்றியவர் யார் ?",
"திவ்யதேசங்களில் எத்தனை பூலோகத்தில் உள்ளன ?",
"ஸப்தப்ரகாரம் கொண்ட திவ்யதேசம் எது ?",
"ஜடாயுவுக்கு வேறு பெயர் என்ன ?",
"திருவடி என்று அழைக்கப்படுபவர் யார் ?",
"வ்யாபக மந்திரங்கள் எத்தனை ? அவை யாவை ?",
"பகவானை அடைய உபாயங்களுக்குள்ளே எளிமையானது எது ?",
"திருமந்திரம் எத்தனை பதங்களாக உள்ளது ?",
"கருடாழ்வாருக்குப் பெரிய திருவடி என்ற பெயர் எதனால் ஏற்பட்டது ? ",
"முமுக்ஷப்படி என்கிற நூல் எவற்றை விவரிக்கிறது ? ",
"அருளிச்செயலின் சாரம் எது ?",
"எம்பெருமான் பகவத்ஸன்னதியின் வாசற்கதவைத் திறப்பதை ஸ்ரீ வைஷ்ணவர்கள் எப்படிச் சொல்ல வேண்டும் ?",
"கோயிலாழ்வார் என்றால் என்ன ?",
"பெருமாளுக்கும், ஆசார்யர்களுக்கும் விசிறி வீசும் கைங்கர்யத்தை எவ்வாறு கூற வேண்டும் ?",
"ஸம்பிரதாயத்தில் நம்மை எவ்வாறு கூறிக்கொள்ள வேண்டும் ?",
"நம்முடைய அகங்களை ஸம்பிரதாயத்தில் எவ்வாறு கூற வேண்டும் ?",
"பெரியவர்கள் குளித்துக் கொண்டிருப்பதை ஸம்பிரதாயத்தில் எவ்வாறு கூற வேண்டும் ?",
"பெரியவர்களை உணவு உட்கொள்ள அழைக்கும்போது - ஸம்பிரதாயத்தில் எவ்வாறு அழைக்க வேண்டும் ?",
"அர்த்த பஞ்சகத்தைக் கூறும் திருவாய்மொழித்தனியனின் தொடக்கம் எது ?",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1"];

var mudhalans = 
[
"ஸ்ரீமன் நாராயணன். ",
"'லஷ்மிநாதஸமாரம்பாம்' என்று ஆரம்பிக்கும் ச்லோகம். ",
"பொய்கையாழ்வார், பூதத்தாழ்வார், பேயாழ்வார். ",
"திருமழிசையாழ்வார்.",
"நம்மாழ்வார், பெரியாழ்வார், ஆண்டாள். ",
"குலசேகர ஆழ்வார். ",
"தொண்டரடிப்பொடியாழ்வார், திருப்பாணாழ்வார்.",
"ஸ்ரீதரன். ",
"1. பரத்வம் 2. வியூகம் 3. அந்தர்யாமித்துவம் 4. விபவம் 5. அர்ச்சாவாதாரம். ",
"திருமங்கை மன்னன்.",
"திருக்குறுங்குடி. ",
"வாதிகேசரி அழகிய மணவாளஜீயர். பொருள் : உலக்கைக் கொழுந்து ",
"பெரிய திருமுடி அடைவு.",
"நஞ்சீயர். ",
"தெற்காழ்வான், கோளரியாழ்வான். ",
"மதுராந்தகம். ",
"திருவரங்கப்பெருமாள் அரையர். ",
"அருளாளப்பெருமாள் எம்பெருமானார். ",
"ஆதிசேஷன்.",
"திருவனந்தாழ்வான். ",
"ஸ்ரீரங்கம், ஸ்ரீவில்லிபுத்தூர், ஆழ்வார் திருநகரி, - திருக்குறுங்குடி, திருநாராயணபுரம். ",
"கண்ணனின் தாய்மாமன். ",
"மணிப்பிரவாள நடை (வடமொழியும் தமிழும் கலந்தது). ",
"திருவாய்மொழி காலக்ஷேபம். ",
"திவ்ய சூரி சரிதம். ",
"பிள்ளைலோகஞ்சீயர். ",
"106.",
"ஸ்ரீரங்கம். ",
"பெரியவுடையார். ",
"ஹனுமான். ",
"மூன்று. அவை நாராயண, வாசுதேவ, விஷ்ணு மந்திரங்கள்.",
"சரணாகதி (அவன் திருவடிகளே வழி). ",
"மூன்று .",
"நித்ய சூரியான அவர் அனுமனுக்கும் முற்பட்டவர் ஆனதால்.",
"திருமந்திரம், த்வயம், ச்ரமச்லோகம்.",
"திருவாய்மொழி. ",
"திருக்காப்பு நீக்குதல் என்று சொல்ல வேண்டும். ",
"நம்முடைய அகங்களில் அர்ச்சை வடிவிலும் சாளக்கிராம வடிவிலும் பெருமாள்களை எழுந்தருளப் பண்ணியுள்ள பெட்டிக்குக் கோயிலாழ்வார் என்று பெயர். ",
"திருவாலவட்ட கைங்கர்யம் என்று கூற வேண்டும்.",
"அடியேன். ",
"அடியேன் குடிசை. ",
"ஸ்வாமி நீராட்டம் கண்டருளுகிறார். ",
"தேவரீர் அமுது செய்ய எழுந்தருள வேண்டும். ",
"மிக்க இறைநிலை.",
"ans7",
"ans8",
"ans8",
"ans7",
"ans8",
"ans8",
"ans9"];

var numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21
, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43];

function shuffle(o) {
    for(var j, x, i = o.length; i; j = parseInt(Math.random() * i), x = o[--i], o[i] = o[j], o[j] = x);
    return o;
};

var random = shuffle(numbers);
console.log(random);
document.getElementById("question1").innerHTML = "1. " + mudhalques[random[0]];
document.getElementById("question2").innerHTML = "2. " + mudhalques[random[1]];
document.getElementById("question3").innerHTML = "3. " + mudhalques[random[2]];
document.getElementById("question4").innerHTML = "4. " + mudhalques[random[3]];
document.getElementById("question5").innerHTML = "5. " + mudhalques[random[4]];
document.getElementById("question6").innerHTML = "6. " + mudhalques[random[5]];
document.getElementById("question7").innerHTML = "7. " + mudhalques[random[6]];
document.getElementById("question8").innerHTML = "8. " + mudhalques[random[7]];
document.getElementById("question9").innerHTML = "9. " + mudhalques[random[8]];
document.getElementById("question10").innerHTML = "10. " + mudhalques[random[9]];

document.getElementById("answer1").innerHTML = "Ans. " + mudhalans[random[0]];
document.getElementById("answer2").innerHTML = "Ans. " + mudhalans[random[1]];
document.getElementById("answer3").innerHTML = "Ans. " + mudhalans[random[2]];
document.getElementById("answer4").innerHTML = "Ans. " + mudhalans[random[3]];
document.getElementById("answer5").innerHTML = "Ans. " + mudhalans[random[4]];
document.getElementById("answer6").innerHTML = "Ans. " + mudhalans[random[5]];
document.getElementById("answer7").innerHTML = "Ans. " + mudhalans[random[6]];
document.getElementById("answer8").innerHTML = "Ans. " + mudhalans[random[7]];
document.getElementById("answer9").innerHTML = "Ans. " + mudhalans[random[8]];
document.getElementById("answer10").innerHTML = "Ans. " + mudhalans[random[9]];

document.getElementById("showhidebut").style.display = "block"
document.getElementById("refreshQuest").style.display = "block"
document.getElementById("refreshpage").style.display = "block"
}