function srirangam2ques() 
{
    functionname ="srirangam2";
    
var mudhalques = 
[
"திருவரங்கத்தில் அவதரித்த ஆசார்யர்கள் யாவர் ?",
"கிளி கூறிய ச்லோகம் என்ன ?",
"கிளிச் சோழன் யார் ?",
"ஸ்ரீரங்கம் கோயில் விமானத்தின் பெயர் என்ன ?",
"ப்ரணயகலஹ உத்ஸவம் பற்றிக் குறிப்பு வரைக ?",
"ஸ்ரீரங்கம் கோயில் எந்த ஆகம முறையில் நடைபெறுகிறது ?",
"திருவரங்கம் எம்பெருமான் திருமங்கையாழ்வாருக்கு தமது 10 அவதாரங்களைக் காண்பித்த இடம் எது ?",
"திருவரங்கநாதனைப் பற்றிப் பராசரபட்டர் எந்த க்ரந்தத்தில் கூறியுள்ளார் ?",
"ஸ்ரீரங்கேச புரோஹிதர் யார் ?",
"திருவரங்கனின் அண்ணன் யார் ?",
"பங்குனி உத்திரத்தின் சிறப்பு என்ன ?",
"அரங்கனின் ஆசார்யர் யார் ? ஏன் ?",
"காட்டழகிய சிங்கர் ஸந்நிதி எங்குள்ளது ?",
"கம்பர் மண்டபம் எங்குள்ளது ?",
"கம்பர் மண்டபத்தின் சிறப்பு என்ன ?",
"மேட்டழகியசிங்கர் ஸந்நிதி - குறிப்பு வரைக",
"அர்ச்சாவதாரம் என்றால் என்ன ?",
"உறையூர் கமலவல்லி நாச்சியார் - குறிப்பு வரைக",
"அரங்கனின் வேறு பெயர்கள் யாவை ?",
"காவிரியின் தனிச்சிறப்பு யாது ?",
"திரு அத்யயனத் திருநாளில் திருநெடுந்தாண்டகம் முதன்மை பெறக் காரணம் என்ன ?",
"குலசேகரன்படி என்று எதற்குப் பெயர் ? ஏன் ?",
"திருமஞ்சனக் கட்டியம் - குறிப்பு வரைக",
"நரசிங்கனுக்கும், திருவரங்கனுக்கும் என்ன வேறுபாடு ?",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1"];

var mudhalans = 
[
"அ) பெரிய நம்பி ஆ) பராசர பட்டர் இ) வடக்குத்திருவீதி பிள்ளை ஈ) பிள்ளை லோகாசாரியார் மற்றும் பலர். ",
"காவேரி விரஜாஸேயம் வைகுண்டம் ரங்கமந்திரம் கல் ஸவாஸுதேவோ ரங்கோ : ப்ரத்யக்ஷம் பரமம் பதம் | விமானம் ப்ரணவாகாரம் வேத ச்ருங்கம் மஹாத்புதம் அதன் ஸ்ரீரங்கசாயீ பகவான் ப்ரணவார்த்த ப்ரகாசக : ",
"ஒரு காலத்தில் ஸ்ரீரங்கம் கோயில் புதைந்து மணல் மேடாக இருந்தது. அப்போது கிளியொன்று அந்த மணல்மேட்டில் அமர்ந்து ரங்கா என்று கத்தி ஒரு ச்லோகமும் கூறிக் கொண்டே சுற்றி வந்தது. அதைக் கேட்ட சோழ மன்னன் அவ்விடத்தை அகழ்ந்து ரங்க விமானத்தை கண்டெடுத்துக் கோயில் கட்டினான். அவனுக்கு அதனால் கிளிச்சோழன் என்ற பெயர் ஏற்பட்டது. (கிளி கூறியதைக் கேட்டு நடந்த சோழன்) ",
"ப்ரணவாகார விமானம் ",
"ப்ரணயகலஹம் - ஊடல் விழா - பங்குனி உத்திரம் அன்று நடைபெறும். பெருமாளுக்கும் தாயாருக்கும் நடக்கும் ஊடல் இதில் காட்டப்படும். ஆகமத்தில் இவ்விழா வேறு சூழலில் நடைபெற்றதாகக் கூறப்பட்டுள்ளது. ",
"பாஞ்சராத்ர ஆகமம், பாரமேசுவர ஸம்ஹிதை.",
"திருமங்கை மன்னன் திருமாளிகை என்கிற தசாவதார சன்னதி. இன்றும் பெருமாள் பத்து அவதாரங்களாக சேவை சாதிக்கிறார். ",
"ஸ்ரீரங்கராஜஸ்தவம், ஸ்ரீரங்கநாத ஸ்தோத்ரம் ",
"ஸ்ரீ பராசர பட்டர் என்னும் ஆசார்யர்.",
"ஸ்ரீமணவாள மாமுனிகள் சிஷ்யரான கோயிலண்ணன் வரத நாராயண குருவைத் திருவரங்கன் 'அண்ணா ' என்று அழைத்தான். ",
"அ) ஸ்ரீரங்க நாச்சியார் பாரில் (பூலோகத்தில்) உதித்த நன்னாள் ஆ) இராமனுக்கும் சீதைக்கும் திருமணம் நடந்த நாள் இ) ஸ்ரீரங்க நாச்சியாருக்கும், அரங்கனுக்கும் ஊடல் ஏற்பட்டு நம்மாழ்வாரால் சமாதானம் செய்விக்கப்பட்டு, வருடத்திற்கு ஒரு நாள் இருவரும் சேர்த்தியில் இருக்கும் நாள். ஈ) உடையவர் இச்சேர்த்தியில் கத்யத்ரயம் சேவித்து - இராமானுச சம்பந்த முடையார்க்கு மோக்ஷம் உண்டு என்று, நமக்காக திவ்ய தம்பதிகளை பிரார்த்தித்து வரம் பெற்ற நன்னாள் உ) நஞ்சீயர் அவதரித்த நன்னாள் ",
"ஸ்ரீமணவாள மாமுனிகள் ஒரு முறை பவித்திர உத்ஸவ சாற்றுமுறையன்று அரங்கன் மாமுனிகளுக்கு அருளப்பாடிட்டு இன்று முதல் ஈடு காலக்ஷேபம் ஸாதியும் என்று கூறி, பிராட்டிமார்களுடன் அழகிய மணவாளன் திருமண்டபத்தில் எழுந்தருளி ஒரு வருட காலம் எல்லா உத்ஸவங்களையும் நிறுத்தச் சொல்லி திருவாய்மொழி வ்யாக்யானமான ஈட்டைக் கேட்டு, 'ஈட்டுக் பெருக்கர்' என்ற பட்டம் கொடுத்து 'ஸ்ரீசைலேச' என்றும் தனியனை சிறுவன் வடிவில் வந்து ஸமர்ப்பித்தார். தமது சேஷபீடத்தையும் தந்து சிறப்பித்தார். இன்றும் மாமுனிகளின் திருநக்ஷத்திர, திருஅத்யயனங் களைத் தாமே நடத்துகிறார். 'போத மணவாளமாமுனி ஈடுரைப்பது கேட்டுப் பூரித்து நின்ற பெரிய பெருமாள்' என்று அரையர்கள் இன்றும் கொண்டாட்டம் சேவிக்கிறார்கள்.",
"காட்டழகிய சிங்கர் ஸந்நிதி திருவரங்கம் ரயில்நிலையம் அருகில் - ஊருக்கு வெளியில் அமைந்துள்ளது. ",
"தாயார் ஸந்நிதிக்கு எதிரில் உள்ள நான்கு கால் மண்டபத்திற்கு கம்பர் மண்டபம் என்று பெயர். ",
"கம்பர் இராமாயணத்தை (நாதமுனிகள் முன்னிலை யில்) ( இந்த மண்டபத்தில் அரங்கேற்றினார். ",
"தாயார் ஸந்நிதிக்கு வெளியில் வலது புறத்தில் உச்சியில் (பல படிகள் கடந்து செல்ல வேண்டும்) (27 அடி உயரம்) மேட்டில் இரணியனை வதம் செய்யும் விதத்தில் எழுந்தருளியுள்ளார். இவருக்கு மேட்டழகிய சிங்கர் என்று பெயர். கம்பர் இராயமாயணம் இயற்றி அரங்கேற்றிய போது, இரணியன் வதை படலம் வந்த போது சிரித்தது செங்கட் சீயம் என்னும் இடத்தில் நிஜமாகச் சிரித்துத் தமது ஒப்புதலைக் கம்பராமாயணத்துக்கு வழங்கிய பெருமை மிக்க மூர்த்தி இவர். ",
"எம்பெருமான் எல்லோருடைய கண்களுக்கும் இலக்காகும்படி திருக்கோயில்களிலும், இல்லங்களிலும் உருவ வடிவத்தில் (சித்திரம், சிலை) இருந்து தன்னை வணங்குவோர்க்கு அருள் பாலிக்கும் நிலையே அர்ச்சாவதாரம் + எனப்படும். ",
"தர்மவர்மாவின் வம்சத்தில் வந்த நந்தசோழனுக்கு மகளாக லட்சுமி தேவியின் அம்சமாக கமலவல்லி நாச்சியார் அவதரித்தாள். பெருமாள் ஜீயபுரம் எழுந்தருளும் போது தோழிகளுடன் நந்தவனத்தில் இருந்த கமலவல்லி, பெருமாளைக் கண்டு விரும்பியதாகவும், பிறகு சோழ மன்னன் கமலவல்லியை அரங்கனுக்கு திருமணம் செய்து வைத்ததாகவும் நூல்கள் கூறுகின்றன. இன்றும் உறையூரில் அழகிய மணவாளனாக ரங்கநாதன் காட்சி தருகிறார். மணக்கோலத்தில் கமலவல்லித்தாயார் வீற்றிருக்கிறார்.",
"1. பெரியபெருமாள் - பெருமாளான இராமன் ஆராதித்ததால் 2. நம்பெருமாள் - உத்ஸவர் 3. அழகிய மணவாளன் - உத்ஸவர் உறையூர் நாச்சியார், ஆண்டாள் இவர்களை மணம் புரிந்ததால் 4. ரங்கநாதன் ரங்கராஜன் - திருவரங்கத்தின் தலைவன். செங்கோலுடைய திருவரங்கச் செல்வனார்.",
"கங்கையின் புனிதமாய காவிரி என்று தொண்டரடிப் பொடியாழ்வார் கொண்டாடும் ஏற்றம் உடையது. ",
"மேல்நாட்டில் (மைசூர்ப் பிராந்தியத்தில்) வேதாந்தி என்னும் அத்வைதியை இவ்வூர்ப் பெருமாளின் பிள்ளையாக கருதப்படுகிற பராசர பட்டர் திருநெடுந்தாண்டகம் என்னும் திருமங்கையாழ்வார் ப்ரபந்தத்தைக் கொண்டு வென்று அவரைத் தன் சீடராக்கிக் கொண்டார். அதனை முடித்து மீண்டும் திருவரங்கம் சேர்ந்தார். அந்நாள் திருவத்யயனத் திருநாளின் முந்தைய நாளாக இருந்தது. அதனால் இங்கு திருநெடுந்தாண்டகம் முதல் திருநாளுக்கு முன்பு சேவித்துக் கொண்டாடப்படுகிறது. ",
"நம் பெருமாள் மூலஸ்தானத்தை ஒட்டி அமைந்த படி குலசேகரன் படி எனப்படும். குலசேகராழ்வார் திருவேங்கடத்தில் படியாய் கிடந்து உன் பவள வாய் காண்பேனே என்று 'படி' (step) யாக இருக்க ஆசைப்பட்டதால் எல்லா திவ்யதேசங்களிலும் பெருமாள் மூலஸ்தானத்தை ஒட்டிய 'படி' (step) குலசேகரன் படி என்று அழைக்கப்படுகிறது.",
"திருவரங்கத்தில் நம்பெருமாள் திருமஞ்சனம் கண்டருளும் போது பராசர பட்டர், வேதவ்யாச பட்டர் திருவம்சத்தினர் கட்டியம் சேவிப்பார்கள். இது முதலில் பராசரபட்டர் ஏற்படுத்தியதாகும். பராசரபட்டர் 64 திருமஞ்சன கட்டியம் செய்ததாகச் சொல்கின்றனர். இவை தனிச்லோகமாக, பெருமாளை நதி, கடல், மலை, சூரியன், வேதம் முதலியவையாக வர்ணித்தும் அல்லது பெருமாள் சேவை சாதிக்கிற நிலையை வர்ணித்தும் செய்யப்பட்டவையாகும். ச்லோகமும் அதன் விளக்கமும் பட்டர் திருவம்சத்தாரால் இன்றும் சேவிக்கப்பட்டுவருகிறது. ",
"ஒரு தூணின் நடுவில் தோன்றியவன் - நரசிங்கன் இரண்டு தூண்களின் (திருமணத்தூண்) நடுவில் தோன்றுபவன் - திருவரங்கன்.",
"ans7",
"ans8",
"ans7",
"ans8",
"ans9"];

var numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23];

function shuffle(o) {
    for(var j, x, i = o.length; i; j = parseInt(Math.random() * i), x = o[--i], o[i] = o[j], o[j] = x);
    return o;
};

var random = shuffle(numbers);
console.log(random);
document.getElementById("question1").innerHTML = "1. " + mudhalques[random[0]];
document.getElementById("question2").innerHTML = "2. " + mudhalques[random[1]];
document.getElementById("question3").innerHTML = "3. " + mudhalques[random[2]];
document.getElementById("question4").innerHTML = "4. " + mudhalques[random[3]];
document.getElementById("question5").innerHTML = "5. " + mudhalques[random[4]];
document.getElementById("question6").innerHTML = "6. " + mudhalques[random[5]];
document.getElementById("question7").innerHTML = "7. " + mudhalques[random[6]];
document.getElementById("question8").innerHTML = "8. " + mudhalques[random[7]];
document.getElementById("question9").innerHTML = "9. " + mudhalques[random[8]];
document.getElementById("question10").innerHTML = "10. " + mudhalques[random[9]];

document.getElementById("answer1").innerHTML = "Ans. " + mudhalans[random[0]];
document.getElementById("answer2").innerHTML = "Ans. " + mudhalans[random[1]];
document.getElementById("answer3").innerHTML = "Ans. " + mudhalans[random[2]];
document.getElementById("answer4").innerHTML = "Ans. " + mudhalans[random[3]];
document.getElementById("answer5").innerHTML = "Ans. " + mudhalans[random[4]];
document.getElementById("answer6").innerHTML = "Ans. " + mudhalans[random[5]];
document.getElementById("answer7").innerHTML = "Ans. " + mudhalans[random[6]];
document.getElementById("answer8").innerHTML = "Ans. " + mudhalans[random[7]];
document.getElementById("answer9").innerHTML = "Ans. " + mudhalans[random[8]];
document.getElementById("answer10").innerHTML = "Ans. " + mudhalans[random[9]];

document.getElementById("showhidebut").style.display = "block"
document.getElementById("refreshQuest").style.display = "block"
document.getElementById("refreshpage").style.display = "block"
}