function srirangam1ques() 
{
    functionname ="srirangam1";
    
var mudhalques = 
[
"கோயில் என்றால் எதைக் குறிக்கும் ஸ்ரீ வைணவ சமயத்தில்?",
"பெரிய கோயில் எது ?",
"பெருமாள் என்று யாரைக் குறிப்பிடுகிறோம் ?",
"பெரியபெருமாள் என்று யாருக்குப் பெயர் ? ஏன் அப்பெயர் ஏற்பட்டது ?",
"ஸ்ரீரங்கவிமானம் முதலில் யாரால் ஆராதிக்கப்பட்டது ?",
"நான்முகன் ரங்க விமானத்தை யாரிடம் ஆராதிக்கக் கொடுத்தார்?",
"ரங்கவிமானம் இம்மண்ணுலகுக்கு வரக் காரணமாக இருந்தவர்?",
"ஸ்ரீரங்கத்தைப் பற்றி எந்த புராதன, இதிகாசங்கள் கூறுகின்றன?",
"திருவரங்கம் கோயிலைச் சுற்றி இருக்கும் ஸப்த ப்ரகாரங்கள் எவை ?",
"ஏழு சுற்றுகள் இருக்கும் திருவரங்கன் கோயில் பரப்பளவு என்ன ?",
"திருவரங்கத்தில் அமைந்துள்ள கோயில்கள், கோபுரங்கள், மண்டபங்கள் எத்தனை ?",
"ரங்க மண்டபத்தில் எத்தனை தூண்கள் உள்ளன ?",
"அடையவளைஞ்சான் மதில் சுவர் எவ்வாறு அமைந்துள்ளது ?",
"வெளி ஆண்டாள் சன்னதி எங்கு அமைந்துள்ளது ?",
"ஸ்வம்வ்யக்த ஸ்தலங்கள் எவை ?",
"திருவரங்கம் திருக்கோயிலைச் சார்ந்த தீர்த்தங்கள் எத்தனை ? அவை யாவை ?",
"திருவரங்கத்தை எத்தனை ஆழ்வார்கள் மங்களாசாஸனம் செய்துள்ளார்கள் ? அவை எத்தனை பாசுரங்கள் ?",
"திருவரங்க கோயிலில் எத்தனை கோபுரங்கள் உள்ளன ? ",
"அரங்கன் தென்திசை நோக்கிப் பள்ளி கொள்ளக் காரணம் என்ன ?",
"அரங்கனை மட்டும் பாடிய ஆழ்வார் யார் ?",
"அரங்கனுக்கு மட்டுமே அமைந்த திவ்யப்ரபந்தங்கள் யாவை?",
"பிற திவ்யதேசத்து எம்பெருமானை விட அரங்கனுக்கு அமைந்த தனிப்பெருமைகள் என்ன ?",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1"];

var mudhalans = 
[
"(ஸ்ரீரங்கம்) திருவரங்கம் ",
"திருவரங்கம் திரு அரங்கநாதர் திருக்கோயில் ",
"ஸ்ரீராமர் ",
"ஸ்ரீரங்கநாதர், பெருமாளான ராமபிரான் சீதையுடன் சேர்ந்து திருவாராதனம் செய்த பெருமாள். ஆகையாலே பெரியபெருமாள் என்று அரங்கனுக்குப் பெயர். ",
"நான்முகள் ப்ரஹ்மா சத்யலோகத்தில் ப்ரஹ்மா",
"சூரியன் ",
"இசஷ்வாகு என்னும் சூரிய குல அரசன் ",
"1. கருடபுராணம் 2. ப்ரம்மாண்ட புராணம் 3. ஸ்ரீரங்கப்ரம்மவித்தை 4. பாரமேசுவர சம்ஹிதை . 6,வால்மீகி ராமாயணம் - உத்தரகாண்டம்",
"1. பூலோகம் - மாடங்கள் சூழ்ந்துள்ள சுற்று; 2. புவர்லோகம் - திருவிக்ரம சோழன் சுற்று; 3. ஸுவர்லோகம் - அகளங்கனென்னும் கிளிச்சோழன் சுற்று; 4. மஹர்லோகம் - குலசேகரன் சுற்று; 5. ஜனர்லோகம் - ஆலிநாடன் அமர்ந்துறையும் வீதி (திருமங்கை ஆழ்வார் சுற்று) 6. தபோலோகம் - ராஜமஹேந்திர சோழன் சுற்று; 7. ஸத்ய லோகம் - (கர்ப்ப க்ருஹமுள்ள சுற்று தர்ம வர்ம சோழ மன்னன் சுற்று.",
"156 ஏக்கர் ",
"51 கோயில்கள், 22 கோபுரங்கள் (புது கோபுரத்தையும் சேர்த்து) 108 மண்டபங்கள் ",
"காயத்திரியின் 24 அக்ஷரங்களைக் குறிக்கும் 24 தூண்கள் உள்ளன. ",
"ஏழு சுற்றுக்களையும் சூழ்ந்து அரணாக அடையவளைஞ்சான் மதில் சுவர் அமைந்துள்ளது. ",
"அடையவளஞ்சான் - திருச்சுற்றில் பாண்டியன் வல்லபதேவனால் கட்டப்பட்ட ஆண்டாள் கோயில் உள்ளது. ஆண்டாள் இவ்விடத்தில் இறங்கி, காவிரியில் குளித்து புத்தாடை அணிந்து பிறகு பல்லக்கில் ஏறி மறைந்ததாகக் கூறுவர். மணக்கோலத்தில் ஆண்டாள் அமர்ந்திருக்கிறாள்.",
"திருவரங்கம், ஸ்ரீமுஷ்ணம், திருமலை, சாளக்கிராமம், நைமிசாரண்யம், வானமாமலை, புஷ்கரம், பத்ரிகாசிரமம். இவற்றில் முதன்மையானது திருவரங்கம். ",
"திருவரங்கம் திருக்கோயிலைச் சார்ந்து ஒன்பது தீர்த்தங்கள் உள்ளன. இரண்டு திருக்காவிரிகள். தென் திருக்காவேரி (காவேரி), வட திருக்காவேரி (கொள்ளிடம்) ",
"11 ஆழ்வார்கள் திருவரங்கத்தை மங்களாசாஸனம் செய்துள்ளனர். மொத்தம் 247 பாசுரங்கள் ஆகும். ",
"17 கோபுரங்கள்.",
"எப்போதும் விபீடணனைக் கடாஷிப்பதற்காக அரங்கன் தென்திசை நோக்கி பள்ளி கொண்டுள்ளார். ",
"தொண்டரடிப் பொடியாழ்வார் ",
"திருப்பள்ளியெழுச்சி, திருமாலை ",
"1. திருப்பாணாழ்வாரைத் தன்னுடன் சேர்த்துக் கொண்டமை. 2. ஆண்டாளை மணம் புரிந்து தன்னுடன் சேர்த்துக் கொண்டமை. 3. இராமானுஜரைத் தன்னிடத்திற்கு வரதரிடம் யாசித்து அழைத்து வந்தமை. 4. திருவாய்மொழிக்கு ஏற்றம் கொடுத்து உத்ஸவம் நடத்திக் கொள்ளுதல் 5. மாமுனிகளிடம் திருவாய்மொழி ஈடு காலக்ஷேபம் சிஷ்யனாய் நின்று கேட்டமை. 6. ஸ்ரீசைலேச தனியன் இயற்றி ஸமர்ப்பித்தமை. 7. எம்பெருமானார்க்கு உடையவர் என்று திருநாமம் சாற்றியமை. 8. நம்மாழ்வார் என்ற பெயரைச் சடகோபனுக்கு அளித்தமை. 9. பட்டரைத் திருமணத்தூணிடை தொட்டிலிட்டு தாலாட்டியமை. 10. திருமந்திரம், த்வயம், சர்மச்லோகம் (ரஹஸ்யத்ரயம்) இவற்றைப் பெரியபெருமாள், பெரியபிராட்டியாருக்கு அருளிச் செய்து ஆசார்ய பரம்பரையைத் தொடங்கி வைத்தார். 11. லஷ்மி நாத ஸமாரம்பாம என்று குருபரம்பரையை தொடக்கியமை மற்றும் பல எண்ணற்ற பெருமை. ",
"ans8",
"ans8",
"ans9",
"ans7",
"ans8",
"ans9"];

var numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21];

function shuffle(o) {
    for(var j, x, i = o.length; i; j = parseInt(Math.random() * i), x = o[--i], o[i] = o[j], o[j] = x);
    return o;
};

var random = shuffle(numbers);
console.log(random);
document.getElementById("question1").innerHTML = "1. " + mudhalques[random[0]];
document.getElementById("question2").innerHTML = "2. " + mudhalques[random[1]];
document.getElementById("question3").innerHTML = "3. " + mudhalques[random[2]];
document.getElementById("question4").innerHTML = "4. " + mudhalques[random[3]];
document.getElementById("question5").innerHTML = "5. " + mudhalques[random[4]];
document.getElementById("question6").innerHTML = "6. " + mudhalques[random[5]];
document.getElementById("question7").innerHTML = "7. " + mudhalques[random[6]];
document.getElementById("question8").innerHTML = "8. " + mudhalques[random[7]];
document.getElementById("question9").innerHTML = "9. " + mudhalques[random[8]];
document.getElementById("question10").innerHTML = "10. " + mudhalques[random[9]];

document.getElementById("answer1").innerHTML = "Ans. " + mudhalans[random[0]];
document.getElementById("answer2").innerHTML = "Ans. " + mudhalans[random[1]];
document.getElementById("answer3").innerHTML = "Ans. " + mudhalans[random[2]];
document.getElementById("answer4").innerHTML = "Ans. " + mudhalans[random[3]];
document.getElementById("answer5").innerHTML = "Ans. " + mudhalans[random[4]];
document.getElementById("answer6").innerHTML = "Ans. " + mudhalans[random[5]];
document.getElementById("answer7").innerHTML = "Ans. " + mudhalans[random[6]];
document.getElementById("answer8").innerHTML = "Ans. " + mudhalans[random[7]];
document.getElementById("answer9").innerHTML = "Ans. " + mudhalans[random[8]];
document.getElementById("answer10").innerHTML = "Ans. " + mudhalans[random[9]];

document.getElementById("showhidebut").style.display = "block"
document.getElementById("refreshQuest").style.display = "block"
document.getElementById("refreshpage").style.display = "block"
}