function thirumangaiazhwarques() 
{
    functionname ="thirumangaiazhwar";
    
var mudhalques = 
[
"திருமங்கையாழ்வார் எந்த ஸ்தலத்தில் அவதரித்தார் ?",
"திருமங்கையாழ்வார் அவதரித்த மாதம் நக்ஷத்திரம் எது ?",
"திருமங்கையாழ்வாரின் பிற பெயர்கள் யாவை ?",
"கலியன் இயற்றிய பிரபந்தங்கள் யாவை ? ",
"தமிழ் வேதத்தின் அங்கங்களுக்குச் சமமாக யாருடைய பிரபந்தங்கள் கருதப்படுகின்றன ?",
"பெரிய திருமொழியில் எத்தனை பாசுரங்கள் உள்ளன ?",
"பெரிய திருமொழியில் எத்தனை பதிகங்கள் உள்ளன ?",
"பெரிய திருமொழியில் முதல் பாசுரத்தின் முதல் சொல் எது ?",
"திருக்குறுந்தாண்டகத்தில் எத்தனை பாசுரங்கள் உள்ளன ?",
"திருக்குறுந்தாண்டகத்தில் முதல் பாசுரத்தின் முதல் சொல் எது ?",
"திருவெழுகூற்றிருக்கையில் எத்தனை பாசுரங்கள் உள்ளன ?",
"திருவெழுகூற்றிருக்கையில் முதல் சொல் எது ?",
"சிறிய திருமடலில் எத்தனை கண்ணிகள் உள்ளன ?",
"சிறிய திருமடலில் முதல் சொல் எது ?",
"பெரிய திருமடலில் எத்தனை கண்ணிகள் உள்ளன ?",
"பெரிய திருமடலில் முதல் சொல் எது ?",
"திருநெடுந்தாண்டகத்தில் எத்தனை பாசுரங்கள் உள்ளன ?",
"திருநெடுந்தாண்டகத்தில் முதல் பாசுரத்தில் உள்ள முதல் சொல் எது ?",
"எத்தனை திவ்ய தேசங்களைத் திருமங்கையாழ்வார் மங்களாஸாசனம் செய்துள்ளார் ?",
"வடபாரதத்தின் பெரும்பாலான திவ்ய தேசங்களை மங்களாசாசனம் செய்த ஆழ்வார் யார் ?",
"திருமங்கையாழ்வாரின் அந்தரங்கர்கள் யாவர் ?",
"திருமங்கையாழ்வாரின் குதிரையின் பெயர் என்ன ?",
"திருமங்கை மன்னன் எந்த இடத்தில் திருமந்தரார்த்தத்தைப் பெற்றார் ? எந்த திவ்யதேசத்தெம்பெருமானிடம் பெற்றார் ?",
"திருமங்கையாழ்வார் எந்த நன்னாளில் திருமந்திரத்தைப் பெற்றார் ?",
"திருமங்கையாழ்வாரின் துணைவியின் பெயர் என்ன ? அவர் பிறந்த திவ்ய தேசம் எது ?",
"இருந்தமிழ் நூற்புலவர் என்று தம்மைத்தாமே கூறிக் கொள்ளும் ஆழ்வார் யார் ?",
"நாலுகவிப்பெருமாள் என்று அழைக்கப்படுபவர் யார் ?",
"திரு இந்தளூர்ப் பெருமானிடம் கோபித்துத் திரும்பிய ஆழ்வார் யார் ?",
"திருமங்கையாழ்வார் சீர்காழியில் யாரை வாதப் போரில் வென்றார்? அதற்குப் பரிசாக எதைப் பெற்றார் ?",
"மாறன் பணித்த தமிழ் மறைக்கு ஆறங்கம் கூற அவதரித்தவர் யார் ?",
"திருவரங்கத்தில் திருஅத்யயன உற்சவத்தை முதன்முதலில் தொடங்கி நடத்தியவர் யார் ?",
"பட்டர் வேதாந்தியான நஞ்சீயரோடு வாதத்தில் வெற்றிபெற எந்தப்பிரபந்தம் உதவியது ?",
"திருமங்கையாழ்வாருக்கு நிதி கொடுத்த பெருமாள் யார் ? எங்கே கொடுத்தார் ?",
"திருமங்கையாழ்வார் திருமதிள் கைங்கர்யம் செய்த இடம் எது ?",
"திருமங்கையாழ்வாரின் மறு அவதாரமாகக் கருதப்படுபவர் யார் ? அவருக்கு மற்றொரு பெயர் என்ன ?",
"திருமங்கையாழ்வார் பரமபதித்த ஸ்தலம் எது ?",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1"];

var mudhalans = 
[
"திருக்குறையலூர். ",
"கார்த்திகை மாதம், கார்த்திகை நக்ஷத்திரம். ",
"நீலன், கலியன், பரகாலன் ஆலிநாடன், அரட்டமுக்கி, அடையார் சீயம், மங்கை வேந்தன், அருள்மாரி, கொங்குமா குழலியார் வேள், குறையலாளி என்பனவாகும். ",
"பெரிய திருமொழி, திருக்குறுந்தாண்டகம், திருவெழுகூற்றிருக்கை, சிறியதிருமடல், பெரியதிருமடல், திருநெடுந்தாண்டகம். ",
"திருமங்கையாழ்வாருடைய ஆறு பிரபந்தங்கள். ",
"1084 பாசுரங்கள். ",
"108 பதிகங்கள் உள்ளன. ",
"வாடினேன். ",
"20 பாசுரங்கள். ",
"நிதியினை.",
"1 பாசுரம். ",
"ஒரு. ",
"77 ½  கண்ணிகள் கொண்ட ஒரு பாட்டு. ",
"காரார். ",
"148 ½ கண்ணிகள் கொண்ட ஒரு பாட்டு. ",
"மன்னிய.",
"30.",
"மின்னுருவாய்.",
"86. ",
"திருமங்கையாழ்வார். ",
"1) தோலா வழக்கன்- 2) நீர்மேல் நடப்பான் 3) நிழலில் ஒதுங்குவான் - 4) தாள்ஊதுவான் ",
"ஆடல் மா",
"திருமணங்கொல்லை, வயலாளி மணவாளன்.",
"பங்குனி உத்திரத்திற்கு முன் இரவு. ",
"குமுதவல்லி, அண்ணன் கோயில் என்கிற திருவெள்ளக்குளத்தில் பிறந்தார். ",
"திருமங்கையாழ்வார். ",
"திருமங்கையாழ்வார். ",
"திருமங்கையாழ்வார். ",
"திருஞானசம்பந்தர் என்னும் சைவக்குரவரை வென்றார். திருஞான சம்பந்தரின் வேல் திருமங்கையாழ்வாருக்கு பரிசாக சமர்ப்பிக்கப்பட்டது.",
"திருமங்கையாழ்வார். ",
"திருமங்கையாழ்வார். ",
"திருநெடுந்தாண்டகம். ",
"திருஅத்தியூரில் எழுந்தருளியிருக்கும் வரதராஜப்பெருமான் (பேரருளாளப்பெருமாள்) வேகவதி ஆற்றின் கரையில் கொடுத்தார்.",
"திருவரங்கம். ",
"நம்பிள்ளை , கலிகன்றிதாசர். ",
"திருக்குறுங்குடி.",
"ans9",
"ans7",
"ans9",
"ans7",
"ans8",
"ans9",
"ans7",
"ans9",
"ans7",
"ans8",
"ans9",
"ans7",
"ans8",
"ans9"];

var numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21
, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35];

function shuffle(o) {
    for(var j, x, i = o.length; i; j = parseInt(Math.random() * i), x = o[--i], o[i] = o[j], o[j] = x);
    return o;
};

var random = shuffle(numbers);
console.log(random);
document.getElementById("question1").innerHTML = "1. " + mudhalques[random[0]];
document.getElementById("question2").innerHTML = "2. " + mudhalques[random[1]];
document.getElementById("question3").innerHTML = "3. " + mudhalques[random[2]];
document.getElementById("question4").innerHTML = "4. " + mudhalques[random[3]];
document.getElementById("question5").innerHTML = "5. " + mudhalques[random[4]];
document.getElementById("question6").innerHTML = "6. " + mudhalques[random[5]];
document.getElementById("question7").innerHTML = "7. " + mudhalques[random[6]];
document.getElementById("question8").innerHTML = "8. " + mudhalques[random[7]];
document.getElementById("question9").innerHTML = "9. " + mudhalques[random[8]];
document.getElementById("question10").innerHTML = "10. " + mudhalques[random[9]];

document.getElementById("answer1").innerHTML = "Ans. " + mudhalans[random[0]];
document.getElementById("answer2").innerHTML = "Ans. " + mudhalans[random[1]];
document.getElementById("answer3").innerHTML = "Ans. " + mudhalans[random[2]];
document.getElementById("answer4").innerHTML = "Ans. " + mudhalans[random[3]];
document.getElementById("answer5").innerHTML = "Ans. " + mudhalans[random[4]];
document.getElementById("answer6").innerHTML = "Ans. " + mudhalans[random[5]];
document.getElementById("answer7").innerHTML = "Ans. " + mudhalans[random[6]];
document.getElementById("answer8").innerHTML = "Ans. " + mudhalans[random[7]];
document.getElementById("answer9").innerHTML = "Ans. " + mudhalans[random[8]];
document.getElementById("answer10").innerHTML = "Ans. " + mudhalans[random[9]];

document.getElementById("showhidebut").style.display = "block"
document.getElementById("refreshQuest").style.display = "block"
document.getElementById("refreshpage").style.display = "block"
}