function varahaques() 
{
    functionname ="varaha";
    
var mudhalques = 
[
"வராஹவதாரத்தை விரிவாகக் கூறும் நூல் யாது ?",
"வராஹம் என்கிற சொல்லுக்குப் பொருள் யாது ?",
"ஹிரண்யாக்ஷன் யாருடைய ஸஹோதரன் ?",
"ஹிரண்யாக்ஷன், ஹிரண்யக் கசிபு இவர்களின் பெற்றோர் யாவர்?",
"அசுரர்களின் வேறுபெயர் என்ன ?",
"ஹிரண்யனும், ஹிரண்யகசிபும் எங்ஙனம் பலத்தை சேர்த்துக் கொண்டனர் ?",
"ஹிரண்யாக்ஷன் கையில் ஏந்திய ஆயுதம் யாது ?",
"ஹிரண்யாக்ஷன் யாரைப் போருக்கு அழைத்தான் ?",
"வருணன் ஹிரண்யாக்ஷனுடன் போரிட்டானா ?",
"ஹிரண்யாக்ஷனைத் திருமாலிடம் போரிடத் தூண்டியது யார்?",
"திருமாலிடம் சண்டையிட ஹிரண்யாக்ஷன் எங்கு செல்ல முற்பட்டான் ?",
"அவளை அங்குச் செல்லவிடாமல் தடுத்தது யார் ? ",
"ஹிரண்யாக்ஷன் திருமாலிடம் சண்டையிட முற்ப்பட்டபோது என்ன சொல்லி நாரதர் தடுத்தார் ?",
"பூமி ஏன் பாதாளத்தில் அழுந்திற்று ?",
"பூமியை வெளிக்கொணரத் திருமால் எந்த உருவத்தை எடுத்தார்?",
"ஹிரண்யாக்ஷன், வராஹப் பெருமானிடம் சண்டையிட்டானா ? முடிவு என்ன ?",
"ஹிரண்யாக்ஷன் அழிவினால் மகிழ்ந்தவர்கள் யார் ?",
"ஹிரண்யாக்ஷனை அழித்த பின்பு வராஹப் பெருமான் என்ன செய்தார் ?",
"பூமிக்கு அபிமானியானவர் யார் ?",
"பூமி வெளிவந்தவுடன் பூமிப்பிராட்டி மகிழ்ந்தாரா ?",
"பூமிப்பிராட்டி (பூதேவியின்) வருத்தத்திற்கு காரணம் யாது ?",
"வராஹப் பெருமானிடம் பூதேவி என்ன வேண்டினார் ?",
"வராஹப் பெருமான் கூறிய வழிகள் (உபாயம்) யாவை ?",
"சரணாகதிக்காக, வராஹப் பெருமான் வெளியிட்ட சுலோகங்கள் எத்தனை ? அவை யாவை ?",
"பகவானிடம், வழிமுறைகளைக் கேட்ட பூதேவி எதனை முக்கியமாக மேற்கொள்ள ஆசை கொண்டாள் ?",
"திருநாம சங்கீர்த்தனத்தைப் பூமிப்பிராட்டி எவ்வாறு நடைமுறைப் படுத்திக்காட்டினாள் ?",
"திருநாமத்தைப் பாடுவதால் உண்டாகும் பூமிபிராட்டி (ஆண்டாள்) விவரிக்கும் பாசுரம் எது ?",
"வராஹப் பெருமான் பூதேவிக்கு கூறிய (திருநாம சங்கீர்த்தனங்கள்) சரித்திரம் எது ?",
"வராஹ புராணத்தில் கூறப்படும் நம்பாடுவான் சரித்திரத்திற்கு என்ன பெயர் ?",
"கைசிக புராணத்தை , 'கெளசிக புராணம்' என்று கூறலாமா ? ஏன் ?",
"நம்பாடுவான் சரித்திரம் நடைபெற்ற க்ஷேத்திரம் யாது ?",
"வராஹப் பெருமான் இன்றும் அர்ச்சாமூர்த்தியாக எழுந்தருளி யிருக்கும் ஸ்தலங்கள் சிலவற்றைக் கூறுக.",
"வராஹப் பெருமானுக்கு நம்மாழ்வார் சூட்டும் திருநாமம் யாது ?",
"வராஹஷேத்ரம் என்று பிரசித்தி பெற்று இருக்கும் ஸ்தலம் யாது ?",
"திருக்கடல்மல்லையில் வராஹ பெருமான் எங்கு எழுந்தருளியிருக்கிறார் ?",
"வராஹ அவதாரத்தை ஆண்டாள் எங்ஙனம் வினோதமாகக் குறிப்பிடுகிறாள் ? ",
"மானமிலாப் பன்றி என்றால் என்ன ?",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1",
"ques1"];

var mudhalans = 
[
"வராஹபுராணம் ",
"பன்றி",
"இரண்ய கசிபு",
"காஸ்யப முனிவர், திதி ",
"தைத்யர்கள் (திதியின் மக்கள்",
"பிரம்மாவைக் குறித்து தவம் செய்து வரம் பெற்றார்கள். ",
"கதை (Gadha) ",
"விபாவரி என்கிற வருணனை. ",
"அஞ்சினபடியால் போர் செய்ய மறுத்துவிட்டான் ",
"வருணன் ",
"வைகுண்டம்",
"நாரதர்.",
"பகவான் வைகுண்டத்தில் இல்லை, பாதாளத்தில் அழுந்தி கிடக்கும் பூமியை வெளிக் கொணர, பாதாள உலகிற்கு சென்றுள்ளார்.",
"ஹிரண்யாக்ஷன் தன் வலிமையினால், பூமியைப் பாயாக (mat) சுருட்டிக் கடலில் முழுகச் செய்திருந்தான்.",
"பன்றி (வராஹம்) ",
"இருவரும் பலவிதமான ஆயுதங்கள் கொண்டு கடுமையாக மோதினர். ஹிரண்யாக்ஷன் மாண்டான். ",
"தேவர்கள்.",
"பூமியை, முன்பிருந்த நிலையில் நிறுத்தினார். ",
"பூமிப்பிராட்டி (பூதேவி) ",
"இல்லை , வருத்தமுற்றாள். ",
"தன் ஒருத்திக்குக் கிடைத்த வாழ்ச்சி (பலன், உஜ்ஜீவனம்) உலகோருக்குக் கிடைக்கவில்லையே என்று. ",
"உமக்கு மாணவியாய், அடிமையாய், பக்தையாய் இருக்கும் என் பொருட்டு உலகனைத்தும் வாழ, சுலபமான உபாயத்தைக் கூறவேண்டும் என வேண்டினார். ",
"1. திருநாம ஸங்கீர்த்தனம் 2. புஷ்பார்ச்சனம் 3. சரணாகதி",
"இரண்டு 1. ஸ்திதே மனஸி........ - என்று ஆரம்பிக்கும் ச்லோகம் 2. ததஸ்தம்....... - என்று ஆரம்பிக்கும் ச்லோகம் ",
"திருநாம ஸங்கீர்த்தனம் ",
"பெரியாழ்வார் திருமகளாக (ஆண்டாள்) அவதரித்து 'திருப்பாவையின்' மூலம் அனுஷ்டித்து காட்டினாள். ",
"ஓங்கி உலகளந்த...",
"நம்பாடுவான் சரித்திரம். ",
"கைசிக புராணம்.",
"கூறலாகாது. கைசிகம் எனும் ராகத்தை (பண்ணினை) அடிப்படையாகக் கொண்டு எழுந்த புராணம் என்பதால் - கைசிக புராணம் என்று பெயர்.",
"திருக்குறுங்குடி மலையில்",
"1) ஸ்ரீ முஷ்ணம் 2) திருமலை (ஸ்வாமி புஷ்கரிணிக் கரையில்) 3) திருவிடவெந்தை 4) திருக்கடல் மல்லையில்.",
"ஞானப்பிரான். ",
"திருமலை (திருவேங்கடம்). ",
"தனிக்கோயிலில் ஞானப்பிரான் என்கிற சந்நிதியில். ",
"'மானமிலாப் பன்றியாம் தேசுடைய தேவர்' நாச்சியார் திருமொழி",
"a. அபிமானமில்லாத பன்றி b. உபமானமில்லாத பன்றி",
"ans7",
"ans8",
"ans9",
"ans7",
"ans9",
"ans7",
"ans8",
"ans9",
"ans7",
"ans8",
"ans9"];

var numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21
    , 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36];

function shuffle(o) {
    for(var j, x, i = o.length; i; j = parseInt(Math.random() * i), x = o[--i], o[i] = o[j], o[j] = x);
    return o;
};

var random = shuffle(numbers);
console.log(random);
document.getElementById("question1").innerHTML = "1. " + mudhalques[random[0]];
document.getElementById("question2").innerHTML = "2. " + mudhalques[random[1]];
document.getElementById("question3").innerHTML = "3. " + mudhalques[random[2]];
document.getElementById("question4").innerHTML = "4. " + mudhalques[random[3]];
document.getElementById("question5").innerHTML = "5. " + mudhalques[random[4]];
document.getElementById("question6").innerHTML = "6. " + mudhalques[random[5]];
document.getElementById("question7").innerHTML = "7. " + mudhalques[random[6]];
document.getElementById("question8").innerHTML = "8. " + mudhalques[random[7]];
document.getElementById("question9").innerHTML = "9. " + mudhalques[random[8]];
document.getElementById("question10").innerHTML = "10. " + mudhalques[random[9]];

document.getElementById("answer1").innerHTML = "Ans. " + mudhalans[random[0]];
document.getElementById("answer2").innerHTML = "Ans. " + mudhalans[random[1]];
document.getElementById("answer3").innerHTML = "Ans. " + mudhalans[random[2]];
document.getElementById("answer4").innerHTML = "Ans. " + mudhalans[random[3]];
document.getElementById("answer5").innerHTML = "Ans. " + mudhalans[random[4]];
document.getElementById("answer6").innerHTML = "Ans. " + mudhalans[random[5]];
document.getElementById("answer7").innerHTML = "Ans. " + mudhalans[random[6]];
document.getElementById("answer8").innerHTML = "Ans. " + mudhalans[random[7]];
document.getElementById("answer9").innerHTML = "Ans. " + mudhalans[random[8]];
document.getElementById("answer10").innerHTML = "Ans. " + mudhalans[random[9]];

document.getElementById("showhidebut").style.display = "block"
document.getElementById("refreshQuest").style.display = "block"
document.getElementById("refreshpage").style.display = "block"
}